[
	{
		"fruit" : "love",
		"verses" : 
		[
			{
				"text" : "Because lawlessness is increased, most people’s love will grow cold.",
				"reference" : "Matthew 24:12"
			},
			{
				"text" : "But woe to you Pharisees! For you pay tithe of mint and rue and every kind of garden herb, and yet disregard justice and the love of God; but these are the things you should have done without neglecting the others.",
				"reference" : "Luke 11:42"
			},
			{
				"text" : "I do not receive glory from men; but I know you, that you do not have the love of God in yourselves.",
				"reference" : "John 5:41-42"
			},
			{
				"text" : "By this all men will know that you are My disciples, if you have love for one another.",
				"reference" : "John 13:35"
			},
			{
				"text" : "Just as the Father has loved Me, I have also loved you; abide in My love.",
				"reference" : "John 15:9"
			},
			{
				"text" : "If you keep My commandments, you will abide in My love; just as I have kept My Father’s commandments and abide in His love.",
				"reference" : "John 15:10"
			},
			{
				"text" : "Greater love has no one than this, that one lay down his life for his friends.",
				"reference" : "John 15:13"
			},
			{
				"text" : "O righteous Father, though the world has not known You, yet I have known You; and these have known that You sent Me; and I have made Your name known to them, and will make it known, so that the love with which You loved Me may be in them, and I in them.",
				"reference" : "John 17:25-26"
			},
			{
				"text" : "And not only this, but we also exult in our tribulations, knowing that tribulation brings about perseverance; and perseverance, proven character; and proven character, hope; and hope does not disappoint, because the love of God has been poured out within our hearts through the Holy Spirit who was given to us.",
				"reference" : "Romans 5:3-5"
			},
			{
				"text" : "But God demonstrates His own love toward us, in that while we were yet sinners, Christ died for us.",
				"reference" : "Romans 5:8"
			},
			{
				"text" : "Who will separate us from the love of Christ? Will tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?",
				"reference" : "Romans 8:35"
			},
			{
				"text" : "For I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers, nor height, nor depth, nor any other created thing, will be able to separate us from the love of God, which is in Christ Jesus our Lord.",
				"reference" : "Romans 8:38-39"
			},
			{
				"text" : "Let love be without hypocrisy. Abhor what is evil; cling to what is good.",
				"reference" : "Romans 12:9"
			},
			{
				"text" : "Love does no wrong to a neighbor; therefore love is the fulfillment of the law.",
				"reference" : "Romans 13:10"
			},
			{
				"text" : "For if because of food your brother is hurt, you are no longer walking according to love. Do not destroy with your food him for whom Christ died.",
				"reference" : "Romans 14:15"
			},
			{
				"text" : "Now I urge you, brethren, by our Lord Jesus Christ and by the love of the Spirit, to strive together with me in your prayers to God for me,",
				"reference" : "Romans 15:30"
			},
			{
				"text" : "What do you desire? Shall I come to you with a rod, or with love and a spirit of gentleness?",
				"reference" : "1 Corinthians 4:21"
			},
			{
				"text" : "Now concerning things sacrificed to idols, we know that we all have knowledge. Knowledge makes arrogant, but love edifies.",
				"reference" : "1 Corinthians 8:1"
			},
			{
				"text" : "If I speak with the tongues of men and of angels, but do not have love, I have become a noisy gong or a clanging cymbal.",
				"reference" : "1 Corinthians 13:1"
			},
			{
				"text" : "If I have the gift of prophecy, and know all mysteries and all knowledge; and if I have all faith, so as to remove mountains, but do not have love, I am nothing.",
				"reference" : "1 Corinthians 13:2"
			},
			{
				"text" : "And if I give all my possessions to feed the poor, and if I surrender my body to be burned, but do not have love, it profits me nothing.",
				"reference" : "1 Corinthians 13:3"
			},
			{
				"text" : "Love is patient, love is kind and is not jealous; love does not brag and is not arrogant,",
				"reference" : "1 Corinthians 13:4"
			},
			{
				"text" : "Love never fails; but if there are gifts of prophecy, they will be done away; if there are tongues, they will cease; if there is knowledge, it will be done away.",
				"reference" : "1 Corinthians 13:8"
			},
			{
				"text" : "But now faith, hope, love, abide these three; but the greatest of these is love.",
				"reference" : "1 Corinthians 13:13"
			},
			{
				"text" : "Let all that you do be done in love.",
				"reference" : "1 Corinthains 16:14"
			},
			{
				"text" : "My love be with you all in Christ Jesus. Amen.",
				"reference" : "1 Corinthians 16:24"
			},
			{
				"text" : "For out of much affliction and anguish of heart I wrote to you with many tears; not so that you would be made sorrowful, but that you might know the love which I have especially for you.",
				"reference" : "2 Corinthians 2:4"
			},
			{
				"text" : "Wherefore I urge you to reaffirm your love for him.",
				"reference" : "2 Corinthians 2:8"
			},
			{
				"text" : "For the love of Christ controls us, having concluded this, that one died for all, therefore all died; and He died for all, so that they who live might no longer live for themselves, but for Him who died and rose again on their behalf.",
				"reference" : "2 Corinthians 5:14-15"
			},
			{
				"text" : "but in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
				"reference" : "2 Corinthians 6:4-6"
			},
			{
				"text" : "But just as you abound in everything, in faith and utterance and knowledge and in all earnestness and in the love we inspired in you, see that you abound in this gracious work also.",
				"reference" : "2 Corinthians 8:7"
			},
			{
				"text" : "I am not speaking this as a command, but as proving through the earnestness of others the sincerity of your love also.",
				"reference" : "2 Corinthians 8:8"
			},
			{
				"text" : "Therefore openly before the churches, show them the proof of your love and of our reason for boasting about you.",
				"reference" : "2 Corinthians 8:24"
			},
			{
				"text" : "Finally, brethren, rejoice, be made complete, be comforted, be like-minded, live in peace; and the God of love and peace will be with you.",
				"reference" : "2 Corinthians 13:11"
			},
			{
				"text" : "The grace of the Lord Jesus Christ, and the love of God, and the fellowship of the Holy Spirit, be with you all.",
				"reference" : "2 Corinthians 13:14"
			},
			{
				"text" : "For in Christ Jesus neither circumcision nor uncircumcision means anything, but faith working through love.",
				"reference" : "Galatians 5:6"
			},
			{
				"text" : "For you were called to freedom, brethren; only do not turn your freedom into an opportunity for the flesh, but through love serve one another.",
				"reference" : "Galatians 5:13"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him. In love He predestined us to adoption as sons through Jesus Christ to Himself, according to the kind intention of His will,",
				"reference" : "Ephesians 1:4-5"
			},
			{
				"text" : "For this reason I too, having heard of the faith in the Lord Jesus which exists among you and your love for all the saints, do not cease giving thanks for you, while making mention of you in my prayers;",
				"reference" : "Ephesians 1:15-16"
			},
			{
				"text" : "But God, being rich in mercy, because of His great love with which He loved us, even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved),",
				"reference" : "Ephesians 2:4-5"
			},
			{
				"text" : "so that Christ may dwell in your hearts through faith; and that you, being rooted and grounded in love, may be able to comprehend with all the saints what is the breadth and length and height and depth,",
				"reference" : "Ephesians 3:17-18"
			},
			{
				"text" : "and to know the love of Christ which surpasses knowledge, that you may be filled up to all the fullness of God.",
				"reference" : "Ephesians 3:19"
			},
			{
				"text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love,",
				"reference" : "Ephesians 4:1-2"
			},
			{
				"text" : "but speaking the truth in love, we are to grow up in all aspects into Him who is the head, even Christ, from whom the whole body, being fitted and held together by what every joint supplies, according to the proper working of each individual part, causes the growth of the body for the building up of itself in love.",
				"reference" : "Ephesians 4:15-16"
			},
			{
				"text" : "Therefore be imitators of God, as beloved children; and walk in love, just as Christ also loved you and gave Himself up for us, an offering and a sacrifice to God as a fragrant aroma.",
				"reference" : "Ephesians 5:1-2"
			},
			{
				"text" : "Peace be to the brethren, and love with faith, from God the Father and the Lord Jesus Christ.",
				"reference" : "Ephesians 6:23"
			},
			{
				"text" : "And this I pray, that your love may abound still more and more in real knowledge and all discernment, so that you may approve the things that are excellent, in order to be sincere and blameless until the day of Christ;",
				"reference" : "Philippians 1:9"
			},
			{
				"text" : "Some, to be sure, are preaching Christ even from envy and strife, but some also from good will; the latter do it out of love, knowing that I am appointed for the defense of the gospel;",
				"reference" : "Philippians 1:15-16"
			},
			{
				"text" : "Therefore if there is any encouragement in Christ, if there is any consolation of love, if there is any fellowship of the Spirit, if any affection and compassion, make my joy complete by being of the same mind, maintaining the same love, united in spirit, intent on one purpose.",
				"reference" : "Philippians 2:1-2"
			},
			{
				"text" : "We give thanks to God, the Father of our Lord Jesus Christ, praying always for you, since we heard of your faith in Christ Jesus and the love which you have for all the saints;",
				"reference" : "Colossians 1:3-4"
			},
			{
				"text" : "just as you learned it from Epaphras, our beloved fellow bond-servant, who is a faithful servant of Christ on our behalf, and he also informed us of your love in the Spirit.",
				"reference" : "Colossians 1:7-8"
			},
			{
				"text" : "For He rescued us from the domain of darkness, and transferred us to the kingdom of His beloved Son, in whom we have redemption, the forgiveness of sins.",
				"reference" : "Colossians 1:13-14"
			},
			{
				"text" : "that their hearts may be encouraged, having been knit together in love, and attaining to all the wealth that comes from the full assurance of understanding, resulting in a true knowledge of God’s mystery, that is, Christ Himself,",
				"reference" : "Colossians 2:2"
			},
			{
				"text" : "Beyond all these things put on love, which is the perfect bond of unity.",
				"reference" : "Colossians 3:14"
			},
			{
				"text" : "We give thanks to God always for all of you, making mention of you in our prayers; constantly bearing in mind your work of faith and labor of love and steadfastness of hope in our Lord Jesus Christ in the presence of our God and Father,",
				"reference" : "1 Thessalonians 1:2-3"
			},
			{
				"text" : "But now that Timothy has come to us from you, and has brought us good news of your faith and love, and that you always think kindly of us, longing to see us just as we also long to see you,",
				"reference" : "1 Thessalonians 3:6"
			},
			{
				"text" : "and may the Lord cause you to increase and abound in love for one another, and for all people, just as we also do for you;",
				"reference" : "1 Thessalonians 3:12"
			},
			{
				"text" : "But since we are of the day, let us be sober, having put on the breastplate of faith and love, and as a helmet, the hope of salvation.",
				"reference" : "1 Thessalonians 5:8"
			},
			{
				"text" : "But we request of you, brethren, that you appreciate those who diligently labor among you, and have charge over you in the Lord and give you instruction, and that you esteem them very highly in love because of their work. Live in peace with one another.",
				"reference" : "1 Thessalonians 5:12-13"
			},
			{
				"text" : "We ought always to give thanks to God for you, brethren, as is only fitting, because your faith is greatly enlarged, and the love of each one of you toward one another grows ever greater;",
				"reference" : "2 Thessalonians 1:3"
			},
			{
				"text" : "and with all the deception of wickedness for those who perish, because they did not receive the love of the truth so as to be saved.",
				"reference" : "2 Thessalonians 2:10"
			},
			{
				"text" : "May the Lord direct your hearts into the love of God and into the steadfastness of Christ.",
				"reference" : "2 Thessalonians 3:5"
			},
			{
				"text" : "But the goal of our instruction is love from a pure heart and a good conscience and a sincere faith.",
				"reference" : "1 Timothy 1:5"
			},
			{
				"text" : "and the grace of our Lord was more than abundant, with the faith and love which are found in Christ Jesus.",
				"reference" : "1 Timothy 1:14"
			},
			{
				"text" : "But women will be preserved through the bearing of children if they continue in faith and love and sanctity with self-restraint.",
				"reference" : "1 Timothy 2:15"
			},
			{
				"text" : "Let no one look down on your youthfulness, but rather in speech, conduct, love, faith and purity, show yourself an example of those who believe.",
				"reference" : "1 Timothy 4:12"
			},
			{
				"text" : "For the love of money is a root of all sorts of evil, and some by longing for it have wandered away from the faith and pierced themselves with many griefs. But flee from these things, you man of God, and pursue righteousness, godliness, faith, love, perseverance and gentleness.",
				"reference" : "1 Timothy 6:10-11"
			},
			{
				"text" : "For God has not given us a spirit of timidity, but of power and love and discipline.",
				"reference" : "2 Timothy 1:7"
			},
			{
				"text" : "Retain the standard of sound words which you have heard from me, in the faith and love which are in Christ Jesus.",
				"reference" : "2 Timothy 1:13"
			},
			{
				"text" : "Now flee from youthful lusts and pursue righteousness, faith, love and peace, with those who call on the Lord from a pure heart.",
				"reference" : "2 Timothy 2:22"
			},
			{
				"text" : "Now you followed my teaching, conduct, purpose, faith, patience, love, perseverance, persecutions, and sufferings, such as happened to me at Antioch, at Iconium and at Lystra; what persecutions I endured, and out of them all the Lord rescued me!",
				"reference" : "2 Timothy 3:10-11"
			},
			{
				"text" : "Older men are to be temperate, dignified, sensible, sound in faith, in love, in perseverance.",
				"reference" : "Titus 2:2"
			},
			{
				"text" : "I thank my God always, making mention of you in my prayers, because I hear of your love and of the faith which you have toward the Lord Jesus and toward all the saints;",
				"reference" : "Philemon 1:4-5"
			},
			{
				"text" : "For I have come to have much joy and comfort in your love, because the hearts of the saints have been refreshed through you, brother.",
				"reference" : "Philemon 1:7"
			},
			{
				"text" : "Therefore, though I have enough confidence in Christ to order you to do what is proper, yet for love’s sake I rather appeal to you—since I am such a person as Paul, the aged, and now also a prisoner of Christ Jesus—",
				"reference" : "Philemon 1:8-9"
			},
			{
				"text" : "For God is not unjust so as to forget your work and the love which you have shown toward His name, in having ministered and in still ministering to the saints.",
				"reference" : "Hebrews 6:10"
			},
			{
				"text" : "and let us consider how to stimulate one another to love and good deeds,",
				"reference" : "Hebrews 10:24"
			},
			{
				"text" : "Above all, keep fervent in your love for one another, because love covers a multitude of sins.",
				"reference" : "1 Peter 4:8"
			},
			{
				"text" : "Greet one another with a kiss of love. Peace be to you all who are in Christ.",
				"reference" : "1 Peter 5:14"
			},
			{
				"text" : "Now for this very reason also, applying all diligence, in your faith supply moral excellence, and in your moral excellence, knowledge, and in your knowledge, self-control, and in your self-control, perseverance, and in your perseverance, godliness, and in your godliness, brotherly kindness, and in your brotherly kindness, love.",
				"reference" : "2 Peter 1:5-7"
			},
			{
				"text" : "but whoever keeps His word, in him the love of God has truly been perfected. By this we know that we are in Him: the one who says he abides in Him ought himself to walk in the same manner as He walked.",
				"reference" : "1 John 2:5-6"
			},
			{
				"text" : "Do not love the world nor the things in the world. If anyone loves the world, the love of the Father is not in him.",
				"reference" : "1 John 2:15"
			},
			{
				"text" : "See how great a love the Father has bestowed on us, that we would be called children of God; and such we are. For this reason the world does not know us, because it did not know Him.",
				"reference" : "1 John 3:1"
			},
			{
				"text" : "We know love by this, that He laid down His life for us; and we ought to lay down our lives for the brethren.",
				"reference" : "1 John 3:16"
			},
			{
				"text" : "But whoever has the world’s goods, and sees his brother in need and closes his heart against him, how does the love of God abide in him?",
				"reference" : "1 John 3:17"
			},
			{
				"text" : "Beloved, let us love one another, for love is from God; and everyone who loves is born of God and knows God.",
				"reference" : "1 John 4:7"
			},
			{
				"text" : "The one who does not love does not know God, for God is love.",
				"reference" : "1 John 4:8"
			},
			{
				"text" : "By this the love of God was manifested in us, that God has sent His only begotten Son into the world so that we might live through Him.",
				"reference" : "1 John 4:9"
			},
			{
				"text" : "In this is love, not that we loved God, but that He loved us and sent His Son to be the propitiation for our sins.",
				"reference" : "1 John 4:10"
			},
			{
				"text" : "No one has seen God at any time; if we love one another, God abides in us, and His love is perfected in us.",
				"reference" : "1 John 4:12"
			},
			{
				"text" : "We have come to know and have believed the love which God has for us. God is love, and the one who abides in love abides in God, and God abides in him.",
				"reference" : "1 John 4:16"
			},
			{
				"text" : "By this, love is perfected with us, so that we may have confidence in the day of judgment; because as He is, so also are we in this world.",
				"reference" : "1 John 4:17"
			},
			{
				"text" : "There is no fear in love; but perfect love casts out fear, because fear involves punishment, and the one who fears is not perfected in love.",
				"reference" : "1 John 4:18"
			},
			{
				"text" : "For this is the love of God, that we keep His commandments; and His commandments are not burdensome.",
				"reference" : "1 John 5:3"
			},
			{
				"text" : "Grace, mercy and peace will be with us, from God the Father and from Jesus Christ, the Son of the Father, in truth and love.",
				"reference" : "2 John 1:3"
			},
			{
				"text" : "And this is love, that we walk according to His commandments. This is the commandment, just as you have heard from the beginning, that you should walk in it.",
				"reference" : "2 John 1:6"
			},
			{
				"text" : "Beloved, you are acting faithfully in whatever you accomplish for the brethren, and especially when they are strangers; and they have testified to your love before the church. You will do well to send them on their way in a manner worthy of God.",
				"reference" : "3 John 1:5-6"
			},
			{
				"text" : "May mercy and peace and love be multiplied to you.",
				"reference" : "Jude 1:2"
			},
			{
				"text" : "These are the men who are hidden reefs in your love feasts when they feast with you without fear, caring for themselves; clouds without water, carried along by winds; autumn trees without fruit, doubly dead, uprooted;",
				"reference" : "Jude 1:12"
			},
			{
				"text" : "keep yourselves in the love of God, waiting anxiously for the mercy of our Lord Jesus Christ to eternal life.",
				"reference" : "Jude 1:21"
			},
			{
				"text" : "But I have this against you, that you have left your first love.",
				"reference" : "Revelation 2:4"
			},
			{
				"text" : "I know your deeds, and your love and faith and service and perseverance, and that your deeds of late are greater than at first.",
				"reference" : "Revelation 2:19"
			}
		]
	},
	{
		"fruit" : "joy",
		"verses" : 
		[
			{
				"text" : "When they saw the star, they rejoiced exceedingly with great joy.",
				"reference" : "Matthew 2:10"
			},
			{
				"text" : "The one on whom seed was sown on the rocky places, this is the man who hears the word and immediately receives it with joy; yet he has no firm root in himself, but is only temporary, and when affliction or persecution arises because of the word, immediately he falls away.",
				"reference" : "Matthew 13:20-21"
			},
			{
				"text" : "The kingdom of heaven is like a treasure hidden in the field, which a man found and hid again; and from joy over it he goes and sells all that he has and buys that field.",
				"reference" : "Matthew 13:44"
			},
			{
				"text" : "His master said to him, ‘Well done, good and faithful slave. You were faithful with a few things, I will put you in charge of many things; enter into the joy of your master.’",
				"reference" : "Matthew 25:21"
			},
			{
				"text" : "His master said to him, ‘Well done, good and faithful slave. You were faithful with a few things, I will put you in charge of many things; enter into the joy of your master.’",
				"reference" : "Matthew 25:23"
			},
			{
				"text" : "And they left the tomb quickly with fear and great joy and ran to report it to His disciples.",
				"reference" : "Matthew 28:8"
			},
			{
				"text" : "In a similar way these are the ones on whom seed was sown on the rocky places, who, when they hear the word, immediately receive it with joy; and they have no firm root in themselves, but are only temporary; then, when affliction or persecution arises because of the word, immediately they fall away.",
				"reference" : "Mark 4:16-17"
			}
		]
	},
	{
		"fruit" : "peace",
		"verses" : 
		[
			{
				"text" : "And whatever city or village you enter, inquire who is worthy in it, and stay at his house until you leave that city. As you enter the house, give it your greeting. If the house is worthy, give it your blessing of peace. But if it is not worthy, take back your blessing of peace.",
				"reference" : "Matthew 10:11-13"
			},
			{
				"text" : "Do not think that I came to bring peace on the earth; I did not come to bring peace, but a sword.",
				"reference" : "Matthew 10:34"
			},
			{
				"text" : "And He said to her, “Daughter, your faith has made you well; go in peace and be healed of your affliction.”",
				"reference" : "Mark 5:34"
			}
		]
	},
	{
		"fruit" : "patience",
		"verses" : 
		[
			{
				"text" : "Or do you think lightly of the riches of His kindness and tolerance and patience, not knowing that the kindness of God leads you to repentance?",
				"reference" : "Romans 2:4"
			},
			{
				"text" : "What if God, although willing to demonstrate His wrath and to make His power known, endured with much patience vessels of wrath prepared for destruction?",
				"reference" : "Romans 9:22"
			},
			{
				"text" : "but in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
				"reference" : "2 Corinthians 6:4-6"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love, being diligent to preserve the unity of the Spirit in the bond of peace.",
				"reference" : "Ephesians 4:1-3"
			},
			{
				"text" : "strengthened with all power, according to His glorious might, for the attaining of all steadfastness and patience; joyously giving thanks to the Father, who has qualified us to share in the inheritance of the saints in Light.",
				"reference" : "Colossians 1:11-12"
			},
			{
				"text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience;",
				"reference" : "Colossians 3:12"
			},
			{
				"text" : "Yet for this reason I found mercy, so that in me as the foremost, Jesus Christ might demonstrate His perfect patience as an example for those who would believe in Him for eternal life.",
				"reference" : "1 Timothy 1:16"
			},
			{
				"text" : "Now you followed my teaching, conduct, purpose, faith, patience, love, perseverance, persecutions, and sufferings, such as happened to me at Antioch, at Iconium and at Lystra; what persecutions I endured, and out of them all the Lord rescued me!",
				"reference" : "2 Timothy 3:10-11"
			},
			{
				"text" : "I solemnly charge you in the presence of God and of Christ Jesus, who is to judge the living and the dead, and by His appearing and His kingdom: preach the word; be ready in season and out of season; reprove, rebuke, exhort, with great patience and instruction.",
				"reference" : "2 Timothy 4:1-2"
			},
			{
				"text" : "And we desire that each one of you show the same diligence so as to realize the full assurance of hope until the end, so that you will not be sluggish, but imitators of those who through faith and patience inherit the promises.",
				"reference" : "Hebrews 6:11-12"
			},
			{
				"text" : "As an example, brethren, of suffering and patience, take the prophets who spoke in the name of the Lord.",
				"reference" : "James 5:10"
			},
			{
				"text" : "Corresponding to that, baptism now saves you—not the removal of dirt from the flesh, but an appeal to God for a good conscience—through the resurrection of Jesus Christ, who is at the right hand of God, having gone into heaven, after angels and authorities and powers had been subjected to Him.",
				"reference" : "1 Peter 3:21-22"
			},
			{
				"text" : "Therefore, beloved, since you look for these things, be diligent to be found by Him in peace, spotless and blameless, and regard the patience of our Lord as salvation; just as also our beloved brother Paul, according to the wisdom given him, wrote to you,",
				"reference" : "2 Peter 3:14-15"
			}
		]
	},
	{
		"fruit" : "kindness",
		"verses" : 
		[
			{
				"text" : "Or do you think lightly of the riches of His kindness and tolerance and patience, not knowing that the kindness of God leads you to repentance?",
				"reference" : "Romans 2:4"
			},
			{
				"text" : "ALL HAVE TURNED ASIDE, TOGETHER THEY HAVE BECOME USELESS; THERE IS NONE WHO DOES GOOD, THERE IS NOT EVEN ONE.",
				"reference" : "Romans 3:12"
			},
			{
				"text" : "Behold then the kindness and severity of God; to those who fell, severity, but to you, God’s kindness, if you continue in His kindness; otherwise you also will be cut off.",
				"reference" : "Romans 11:22"
			},
			{
				"text" : "but in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
				"reference" : "2 Corinthians 6:4-6"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "But God, being rich in mercy, because of His great love with which He loved us, even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved), and raised us up with Him, and seated us with Him in the heavenly places in Christ Jesus, so that in the ages to come He might show the surpassing riches of His grace in kindness toward us in Christ Jesus.",
				"reference" : "Ephesians 2:4-7"
			},
			{
				"text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience;",
				"reference" : "Colossians 3:12"
			},
			{
				"text" : "But when the kindness of God our Savior and His love for mankind appeared, He saved us, not on the basis of deeds which we have done in righteousness, but according to His mercy, by the washing of regeneration and renewing by the Holy Spirit,",
				"reference" : "2 Timothy 3:4-5"
			}
		]
	},
	{
		"fruit" : "goodness",
		"verses" : 
		[
			{
				"text" : "And concerning you, my brethren, I myself also am convinced that you yourselves are full of goodness, filled with all knowledge and able also to admonish one another.",
				"reference" : "Romans 15:14"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "Therefore do not be partakers with them; for you were formerly darkness, but now you are Light in the Lord; walk as children of Light (for the fruit of the Light consists in all goodness and righteousness and truth), trying to learn what is pleasing to the Lord.",
				"reference" : "Ephesians 5:7-10"
			},
			{
				"text" : "To this end also we pray for you always, that our God will count you worthy of your calling, and fulfill every desire for goodness and the work of faith with power, so that the name of our Lord Jesus will be glorified in you, and you in Him, according to the grace of our God and the Lord Jesus Christ.",
				"reference" : "2 Thessalonians 1:11-12"
			}
		]
	},
	{
		"fruit" : "faithfulness",
		"verses" : 
		[
			{
				"text" : "Now when Jesus heard this, He marveled and said to those who were following, “Truly I say to you, I have not found such great faith with anyone in Israel.”",
				"reference" : "Matthew 8:10"
			},
			{
				"text" : "And they brought to Him a paralytic lying on a bed. Seeing their faith, Jesus said to the paralytic, “Take courage, son; your sins are forgiven.”",
				"reference" : "Matthew 9:2"
			},
			{
				"text" : "But Jesus turning and seeing her said, “Daughter, take courage; your faith has made you well.” At once the woman was made well.",
				"reference" : "Matthew 9:22"
			},
			{
				"text" : "When He entered the house, the blind men came up to Him, and Jesus said to them, “Do you believe that I am able to do this?” They said to Him, “Yes, Lord.” Then He touched their eyes, saying, “It shall be done to you according to your faith.”",
				"reference" : "Matthew 9:28-29"
			},
			{
				"text" : "Then Jesus said to her, “O woman, your faith is great; it shall be done for you as you wish.” And her daughter was healed at once.",
				"reference" : "Matthew 15:28"
			},
			{
				"text" : "And He said to them, “Because of the littleness of your faith; for truly I say to you, if you have faith the size of a mustard seed, you will say to this mountain, 'Move from here to there,' and it will move; and nothing will be impossible to you.”",
				"reference" : "Matthew 17:20"
			},
			{
				"text" : "And Jesus answered and said to them, “Truly I say to you, if you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you say to this mountain, 'Be taken up and cast into the sea,' it will happen.”",
				"reference" : "Matthew 21:21"
			},
			{
				"text" : "Woe to you, scribes and Pharisees, hypocrites! For you tithe mint and dill and cummin, and have neglected the weightier provisions of the law: justice and mercy and faithfulness; but these are the things you should have done without neglecting the others.",
				"reference" : "Matthew 23:23"
			}
		]
	},
	{
		"fruit" : "gentleness",
		"verses" : 
		[
			{
				"text" : "What do you desire? Shall I come to you with a rod, or with love and a spirit of gentleness?",
				"reference" : "1 Corinthians 4:21"
			},
			{
				"text" : "Now I, Paul, myself urge you by the meekness and gentleness of Christ—I who am meek when face to face with you, but bold toward you when absent!",
				"reference" : "2 Corinthians 10:1"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "Brethren, even if anyone is caught in any trespass, you who are spiritual, restore such a one in a spirit of gentleness; each one looking to yourself, so that you too will not be tempted.",
				"reference" : "Galatians 6:1"
			},
			{
				"text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love, being diligent to preserve the unity of the Spirit in the bond of peace.",
				"reference" : "Ephesians 4:1-3"
			},
			{
				"text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience; bearing with one another, and forgiving each other, whoever has a complaint against anyone; just as the Lord forgave you, so also should you.",
				"reference" : "Colossians 3:12-13"
			},
			{
				"text" : "The Lord’s bond-servant must not be quarrelsome, but be kind to all, able to teach, patient when wronged, with gentleness correcting those who are in opposition, if perhaps God may grant them repentance leading to the knowledge of the truth,",
				"reference" : "2 Timothy 2:24-25"
			},
			{
				"text" : "Remind them to be subject to rulers, to authorities, to be obedient, to be ready for every good deed, to malign no one, to be peaceable, gentle, showing every consideration for all men.",
				"reference" : "Titus 3:1-2"
			},
			{
				"text" : "Therefore, putting aside all filthiness and all that remains of wickedness, in humility receive the word implanted, which is able to save your souls.",
				"reference" : "James 1:21"
			},
			{
				"text" : "Who among you is wise and understanding? Let him show by his good behavior his deeds in the gentleness of wisdom.",
				"reference" : "James 3:13"
			},
			{
				"text" : "But even if you should suffer for the sake of righteousness, you are blessed. AND DO NOT FEAR THEIR INTIMIDATION, AND DO NOT BE TROUBLED, but sanctify Christ as Lord in your hearts, always being ready to make a defense to everyone who asks you to give an account for the hope that is in you, yet with gentleness and reverence;",
				"reference" : "1 Peter 3:14-15"
			}
		]
	},
	{
		"fruit" : "selfcontrol",
		"verses" : 
		[
			{
				"text" : "But as he was discussing righteousness, self-control and the judgment to come, Felix became frightened and said, “Go away for the present, and when I find time I will summon you.”",
				"reference" : "Act 24:25"
			},
			{
				"text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
				"reference" : "Galatians 5:22-23"
			},
			{
				"text" : "Now for this very reason also, applying all diligence, in your faith supply moral excellence, and in your moral excellence, knowledge, and in your knowledge, self-control, and in your self-control, perseverance, and in your perseverance, godliness, and in your godliness, brotherly kindness, and in your brotherly kindness, love.",
				"reference" : "2 Peter 1:5-7"
			}
		]
	}
]