[
    {
        "fruit" : "love",
        "verses" :
        [
            {
                "text" : "Because lawlessness is increased, most people's love will grow cold.",
                "reference" : "Matthew 24:12"
            },
            {
                "text" : "But woe to you Pharisees! For you pay tithe of mint and rue and every kind of garden herb, and yet disregard justice and the love of God; but these are the things you should have done without neglecting the others.",
                "reference" : "Luke 11:42"
            },
            {
                "text" : "I do not receive glory from men; but I know you, that you do not have the love of God in yourselves.",
                "reference" : "John 5:41-42"
            },
            {
                "text" : "By this all men will know that you are My disciples, if you have love for one another.",
                "reference" : "John 13:35"
            },
            {
                "text" : "Just as the Father has loved Me, I have also loved you; abide in My love.",
                "reference" : "John 15:9"
            },
            {
                "text" : "If you keep My commandments, you will abide in My love; just as I have kept My Father's commandments and abide in His love.",
                "reference" : "John 15:10"
            },
            {
                "text" : "Greater love has no one than this, that one lay down his life for his friends.",
                "reference" : "John 15:13"
            },
            {
                "text" : "O righteous Father, though the world has not known You, yet I have known You; and these have known that You sent Me; and I have made Your name known to them, and will make it known, so that the love with which You loved Me may be in them, and I in them.",
                "reference" : "John 17:25-26"
            },
            {
                "text" : "And not only this, but we also exult in our tribulations, knowing that tribulation brings about perseverance; and perseverance, proven character; and proven character, hope; and hope does not disappoint, because the love of God has been poured out within our hearts through the Holy Spirit who was given to us.",
                "reference" : "Romans 5:3-5"
            },
            {
                "text" : "But God demonstrates His own love toward us, in that while we were yet sinners, Christ died for us.",
                "reference" : "Romans 5:8"
            },
            {
                "text" : "Who will separate us from the love of Christ? Will tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?",
                "reference" : "Romans 8:35"
            },
            {
                "text" : "For I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers, nor height, nor depth, nor any other created thing, will be able to separate us from the love of God, which is in Christ Jesus our Lord.",
                "reference" : "Romans 8:38-39"
            },
            {
                "text" : "Let love be without hypocrisy. Abhor what is evil; cling to what is good.",
                "reference" : "Romans 12:9"
            },
            {
                "text" : "Love does no wrong to a neighbor; therefore love is the fulfillment of the law.",
                "reference" : "Romans 13:10"
            },
            {
                "text" : "For if because of food your brother is hurt, you are no longer walking according to love. Do not destroy with your food him for whom Christ died.",
                "reference" : "Romans 14:15"
            },
            {
                "text" : "Now I urge you, brethren, by our Lord Jesus Christ and by the love of the Spirit, to strive together with me in your prayers to God for me,",
                "reference" : "Romans 15:30"
            },
            {
                "text" : "What do you desire? Shall I come to you with a rod, or with love and a spirit of gentleness?",
                "reference" : "1 Corinthians 4:21"
            },
            {
                "text" : "Now concerning things sacrificed to idols, we know that we all have knowledge. Knowledge makes arrogant, but love edifies.",
                "reference" : "1 Corinthians 8:1"
            },
            {
                "text" : "If I speak with the tongues of men and of angels, but do not have love, I have become a noisy gong or a clanging cymbal.",
                "reference" : "1 Corinthians 13:1"
            },
            {
                "text" : "If I have the gift of prophecy, and know all mysteries and all knowledge; and if I have all faith, so as to remove mountains, but do not have love, I am nothing.",
                "reference" : "1 Corinthians 13:2"
            },
            {
                "text" : "And if I give all my possessions to feed the poor, and if I surrender my body to be burned, but do not have love, it profits me nothing.",
                "reference" : "1 Corinthians 13:3"
            },
            {
                "text" : "Love is patient, love is kind and is not jealous; love does not brag and is not arrogant,",
                "reference" : "1 Corinthians 13:4"
            },
            {
                "text" : "Love never fails; but if there are gifts of prophecy, they will be done away; if there are tongues, they will cease; if there is knowledge, it will be done away.",
                "reference" : "1 Corinthians 13:8"
            },
            {
                "text" : "But now faith, hope, love, abide these three; but the greatest of these is love.",
                "reference" : "1 Corinthians 13:13"
            },
            {
                "text" : "Let all that you do be done in love.",
                "reference" : "1 Corinthains 16:14"
            },
            {
                "text" : "My love be with you all in Christ Jesus. Amen.",
                "reference" : "1 Corinthians 16:24"
            },
            {
                "text" : "For out of much affliction and anguish of heart I wrote to you with many tears; not so that you would be made sorrowful, but that you might know the love which I have especially for you.",
                "reference" : "2 Corinthians 2:4"
            },
            {
                "text" : "Wherefore I urge you to reaffirm your love for him.",
                "reference" : "2 Corinthians 2:8"
            },
            {
                "text" : "For the love of Christ controls us, having concluded this, that one died for all, therefore all died; and He died for all, so that they who live might no longer live for themselves, but for Him who died and rose again on their behalf.",
                "reference" : "2 Corinthians 5:14-15"
            },
            {
                "text" : "But in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
                "reference" : "2 Corinthians 6:4-6"
            },
            {
                "text" : "But just as you abound in everything, in faith and utterance and knowledge and in all earnestness and in the love we inspired in you, see that you abound in this gracious work also.",
                "reference" : "2 Corinthians 8:7"
            },
            {
                "text" : "I am not speaking this as a command, but as proving through the earnestness of others the sincerity of your love also.",
                "reference" : "2 Corinthians 8:8"
            },
            {
                "text" : "Therefore openly before the churches, show them the proof of your love and of our reason for boasting about you.",
                "reference" : "2 Corinthians 8:24"
            },
            {
                "text" : "Finally, brethren, rejoice, be made complete, be comforted, be like-minded, live in peace; and the God of love and peace will be with you.",
                "reference" : "2 Corinthians 13:11"
            },
            {
                "text" : "The grace of the Lord Jesus Christ, and the love of God, and the fellowship of the Holy Spirit, be with you all.",
                "reference" : "2 Corinthians 13:14"
            },
            {
                "text" : "For in Christ Jesus neither circumcision nor uncircumcision means anything, but faith working through love.",
                "reference" : "Galatians 5:6"
            },
            {
                "text" : "For you were called to freedom, brethren; only do not turn your freedom into an opportunity for the flesh, but through love serve one another.",
                "reference" : "Galatians 5:13"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "Just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him. In love He predestined us to adoption as sons through Jesus Christ to Himself, according to the kind intention of His will,",
                "reference" : "Ephesians 1:4-5"
            },
            {
                "text" : "For this reason I too, having heard of the faith in the Lord Jesus which exists among you and your love for all the saints, do not cease giving thanks for you, while making mention of you in my prayers;",
                "reference" : "Ephesians 1:15-16"
            },
            {
                "text" : "But God, being rich in mercy, because of His great love with which He loved us, even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved),",
                "reference" : "Ephesians 2:4-5"
            },
            {
                "text" : "So that Christ may dwell in your hearts through faith; and that you, being rooted and grounded in love, may be able to comprehend with all the saints what is the breadth and length and height and depth,",
                "reference" : "Ephesians 3:17-18"
            },
            {
                "text" : "And to know the love of Christ which surpasses knowledge, that you may be filled up to all the fullness of God.",
                "reference" : "Ephesians 3:19"
            },
            {
                "text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love,",
                "reference" : "Ephesians 4:1-2"
            },
            {
                "text" : "But speaking the truth in love, we are to grow up in all aspects into Him who is the head, even Christ, from whom the whole body, being fitted and held together by what every joint supplies, according to the proper working of each individual part, causes the growth of the body for the building up of itself in love.",
                "reference" : "Ephesians 4:15-16"
            },
            {
                "text" : "Therefore be imitators of God, as beloved children; and walk in love, just as Christ also loved you and gave Himself up for us, an offering and a sacrifice to God as a fragrant aroma.",
                "reference" : "Ephesians 5:1-2"
            },
            {
                "text" : "Peace be to the brethren, and love with faith, from God the Father and the Lord Jesus Christ.",
                "reference" : "Ephesians 6:23"
            },
            {
                "text" : "And this I pray, that your love may abound still more and more in real knowledge and all discernment, so that you may approve the things that are excellent, in order to be sincere and blameless until the day of Christ;",
                "reference" : "Philippians 1:9"
            },
            {
                "text" : "Some, to be sure, are preaching Christ even from envy and strife, but some also from good will; the latter do it out of love, knowing that I am appointed for the defense of the gospel;",
                "reference" : "Philippians 1:15-16"
            },
            {
                "text" : "Therefore if there is any encouragement in Christ, if there is any consolation of love, if there is any fellowship of the Spirit, if any affection and compassion, make my joy complete by being of the same mind, maintaining the same love, united in spirit, intent on one purpose.",
                "reference" : "Philippians 2:1-2"
            },
            {
                "text" : "We give thanks to God, the Father of our Lord Jesus Christ, praying always for you, since we heard of your faith in Christ Jesus and the love which you have for all the saints;",
                "reference" : "Colossians 1:3-4"
            },
            {
                "text" : "Just as you learned it from Epaphras, our beloved fellow bond-servant, who is a faithful servant of Christ on our behalf, and he also informed us of your love in the Spirit.",
                "reference" : "Colossians 1:7-8"
            },
            {
                "text" : "For He rescued us from the domain of darkness, and transferred us to the kingdom of His beloved Son, in whom we have redemption, the forgiveness of sins.",
                "reference" : "Colossians 1:13-14"
            },
            {
                "text" : "That their hearts may be encouraged, having been knit together in love, and attaining to all the wealth that comes from the full assurance of understanding, resulting in a true knowledge of God's mystery, that is, Christ Himself,",
                "reference" : "Colossians 2:2"
            },
            {
                "text" : "Beyond all these things put on love, which is the perfect bond of unity.",
                "reference" : "Colossians 3:14"
            },
            {
                "text" : "We give thanks to God always for all of you, making mention of you in our prayers; constantly bearing in mind your work of faith and labor of love and steadfastness of hope in our Lord Jesus Christ in the presence of our God and Father,",
                "reference" : "1 Thessalonians 1:2-3"
            },
            {
                "text" : "But now that Timothy has come to us from you, and has brought us good news of your faith and love, and that you always think kindly of us, longing to see us just as we also long to see you,",
                "reference" : "1 Thessalonians 3:6"
            },
            {
                "text" : "And may the Lord cause you to increase and abound in love for one another, and for all people, just as we also do for you;",
                "reference" : "1 Thessalonians 3:12"
            },
            {
                "text" : "But since we are of the day, let us be sober, having put on the breastplate of faith and love, and as a helmet, the hope of salvation.",
                "reference" : "1 Thessalonians 5:8"
            },
            {
                "text" : "But we request of you, brethren, that you appreciate those who diligently labor among you, and have charge over you in the Lord and give you instruction, and that you esteem them very highly in love because of their work. Live in peace with one another.",
                "reference" : "1 Thessalonians 5:12-13"
            },
            {
                "text" : "We ought always to give thanks to God for you, brethren, as is only fitting, because your faith is greatly enlarged, and the love of each one of you toward one another grows ever greater;",
                "reference" : "2 Thessalonians 1:3"
            },
            {
                "text" : "And with all the deception of wickedness for those who perish, because they did not receive the love of the truth so as to be saved.",
                "reference" : "2 Thessalonians 2:10"
            },
            {
                "text" : "May the Lord direct your hearts into the love of God and into the steadfastness of Christ.",
                "reference" : "2 Thessalonians 3:5"
            },
            {
                "text" : "But the goal of our instruction is love from a pure heart and a good conscience and a sincere faith.",
                "reference" : "1 Timothy 1:5"
            },
            {
                "text" : "And the grace of our Lord was more than abundant, with the faith and love which are found in Christ Jesus.",
                "reference" : "1 Timothy 1:14"
            },
            {
                "text" : "But women will be preserved through the bearing of children if they continue in faith and love and sanctity with self-restraint.",
                "reference" : "1 Timothy 2:15"
            },
            {
                "text" : "Let no one look down on your youthfulness, but rather in speech, conduct, love, faith and purity, show yourself an example of those who believe.",
                "reference" : "1 Timothy 4:12"
            },
            {
                "text" : "For the love of money is a root of all sorts of evil, and some by longing for it have wandered away from the faith and pierced themselves with many griefs. But flee from these things, you man of God, and pursue righteousness, godliness, faith, love, perseverance and gentleness.",
                "reference" : "1 Timothy 6:10-11"
            },
            {
                "text" : "For God has not given us a spirit of timidity, but of power and love and discipline.",
                "reference" : "2 Timothy 1:7"
            },
            {
                "text" : "Retain the standard of sound words which you have heard from me, in the faith and love which are in Christ Jesus.",
                "reference" : "2 Timothy 1:13"
            },
            {
                "text" : "Now flee from youthful lusts and pursue righteousness, faith, love and peace, with those who call on the Lord from a pure heart.",
                "reference" : "2 Timothy 2:22"
            },
            {
                "text" : "Now you followed my teaching, conduct, purpose, faith, patience, love, perseverance, persecutions, and sufferings, such as happened to me at Antioch, at Iconium and at Lystra; what persecutions I endured, and out of them all the Lord rescued me!",
                "reference" : "2 Timothy 3:10-11"
            },
            {
                "text" : "Older men are to be temperate, dignified, sensible, sound in faith, in love, in perseverance.",
                "reference" : "Titus 2:2"
            },
            {
                "text" : "I thank my God always, making mention of you in my prayers, because I hear of your love and of the faith which you have toward the Lord Jesus and toward all the saints;",
                "reference" : "Philemon 1:4-5"
            },
            {
                "text" : "For I have come to have much joy and comfort in your love, because the hearts of the saints have been refreshed through you, brother.",
                "reference" : "Philemon 1:7"
            },
            {
                "text" : "Therefore, though I have enough confidence in Christ to order you to do what is proper, yet for love's sake I rather appeal to you-since I am such a person as Paul, the aged, and now also a prisoner of Christ Jesus-",
                "reference" : "Philemon 1:8-9"
            },
            {
                "text" : "For God is not unjust so as to forget your work and the love which you have shown toward His name, in having ministered and in still ministering to the saints.",
                "reference" : "Hebrews 6:10"
            },
            {
                "text" : "And let us consider how to stimulate one another to love and good deeds,",
                "reference" : "Hebrews 10:24"
            },
            {
                "text" : "Above all, keep fervent in your love for one another, because love covers a multitude of sins.",
                "reference" : "1 Peter 4:8"
            },
            {
                "text" : "Greet one another with a kiss of love. Peace be to you all who are in Christ.",
                "reference" : "1 Peter 5:14"
            },
            {
                "text" : "Now for this very reason also, applying all diligence, in your faith supply moral excellence, and in your moral excellence, knowledge, and in your knowledge, self-control, and in your self-control, perseverance, and in your perseverance, godliness, and in your godliness, brotherly kindness, and in your brotherly kindness, love.",
                "reference" : "2 Peter 1:5-7"
            },
            {
                "text" : "But whoever keeps His word, in him the love of God has truly been perfected. By this we know that we are in Him: the one who says he abides in Him ought himself to walk in the same manner as He walked.",
                "reference" : "1 John 2:5-6"
            },
            {
                "text" : "Do not love the world nor the things in the world. If anyone loves the world, the love of the Father is not in him.",
                "reference" : "1 John 2:15"
            },
            {
                "text" : "See how great a love the Father has bestowed on us, that we would be called children of God; and such we are. For this reason the world does not know us, because it did not know Him.",
                "reference" : "1 John 3:1"
            },
            {
                "text" : "We know love by this, that He laid down His life for us; and we ought to lay down our lives for the brethren.",
                "reference" : "1 John 3:16"
            },
            {
                "text" : "But whoever has the world's goods, and sees his brother in need and closes his heart against him, how does the love of God abide in him?",
                "reference" : "1 John 3:17"
            },
            {
                "text" : "Beloved, let us love one another, for love is from God; and everyone who loves is born of God and knows God.",
                "reference" : "1 John 4:7"
            },
            {
                "text" : "The one who does not love does not know God, for God is love.",
                "reference" : "1 John 4:8"
            },
            {
                "text" : "By this the love of God was manifested in us, that God has sent His only begotten Son into the world so that we might live through Him.",
                "reference" : "1 John 4:9"
            },
            {
                "text" : "In this is love, not that we loved God, but that He loved us and sent His Son to be the propitiation for our sins.",
                "reference" : "1 John 4:10"
            },
            {
                "text" : "No one has seen God at any time; if we love one another, God abides in us, and His love is perfected in us.",
                "reference" : "1 John 4:12"
            },
            {
                "text" : "We have come to know and have believed the love which God has for us. God is love, and the one who abides in love abides in God, and God abides in him.",
                "reference" : "1 John 4:16"
            },
            {
                "text" : "By this, love is perfected with us, so that we may have confidence in the day of judgment; because as He is, so also are we in this world.",
                "reference" : "1 John 4:17"
            },
            {
                "text" : "There is no fear in love; but perfect love casts out fear, because fear involves punishment, and the one who fears is not perfected in love.",
                "reference" : "1 John 4:18"
            },
            {
                "text" : "For this is the love of God, that we keep His commandments; and His commandments are not burdensome.",
                "reference" : "1 John 5:3"
            },
            {
                "text" : "Grace, mercy and peace will be with us, from God the Father and from Jesus Christ, the Son of the Father, in truth and love.",
                "reference" : "2 John 1:3"
            },
            {
                "text" : "And this is love, that we walk according to His commandments. This is the commandment, just as you have heard from the beginning, that you should walk in it.",
                "reference" : "2 John 1:6"
            },
            {
                "text" : "Beloved, you are acting faithfully in whatever you accomplish for the brethren, and especially when they are strangers; and they have testified to your love before the church. You will do well to send them on their way in a manner worthy of God.",
                "reference" : "3 John 1:5-6"
            },
            {
                "text" : "May mercy and peace and love be multiplied to you.",
                "reference" : "Jude 1:2"
            },
            {
                "text" : "These are the men who are hidden reefs in your love feasts when they feast with you without fear, caring for themselves; clouds without water, carried along by winds; autumn trees without fruit, doubly dead, uprooted;",
                "reference" : "Jude 1:12"
            },
            {
                "text" : "Keep yourselves in the love of God, waiting anxiously for the mercy of our Lord Jesus Christ to eternal life.",
                "reference" : "Jude 1:21"
            },
            {
                "text" : "But I have this against you, that you have left your first love.",
                "reference" : "Revelation 2:4"
            },
            {
                "text" : "I know your deeds, and your love and faith and service and perseverance, and that your deeds of late are greater than at first.",
                "reference" : "Revelation 2:19"
            }
        ]
    },
    {
        "fruit" : "joy",
        "verses" :
        [
            {
                "text" : "When they saw the star, they rejoiced exceedingly with great joy.",
                "reference" : "Matthew 2:10"
            },
            {
                "text" : "The one on whom seed was sown on the rocky places, this is the man who hears the word and immediately receives it with joy; yet he has no firm root in himself, but is only temporary, and when affliction or persecution arises because of the word, immediately he falls away.",
                "reference" : "Matthew 13:20-21"
            },
            {
                "text" : "The kingdom of heaven is like a treasure hidden in the field, which a man found and hid again; and from joy over it he goes and sells all that he has and buys that field.",
                "reference" : "Matthew 13:44"
            },
            {
                "text" : "His master said to him, 'Well done, good and faithful slave. You were faithful with a few things, I will put you in charge of many things; enter into the joy of your master.'",
                "reference" : "Matthew 25:21"
            },
            {
                "text" : "His master said to him, 'Well done, good and faithful slave. You were faithful with a few things, I will put you in charge of many things; enter into the joy of your master.'",
                "reference" : "Matthew 25:23"
            },
            {
                "text" : "And they left the tomb quickly with fear and great joy and ran to report it to His disciples.",
                "reference" : "Matthew 28:8"
            },
            {
                "text" : "In a similar way these are the ones on whom seed was sown on the rocky places, who, when they hear the word, immediately receive it with joy; and they have no firm root in themselves, but are only temporary; then, when affliction or persecution arises because of the word, immediately they fall away.",
                "reference" : "Mark 4:16-17"
            },
            {
                "text" : "You will have joy and gladness, and many will rejoice at his birth.",
                "reference" : "Luke 1:14"
            },
            {
                "text" : "But the angel said to them, \"Do not be afraid; for behold, I bring you good news of great joy which will be for all the people;\"",
                "reference" : "Luke 2:10"
            },
            {
                "text" : "Those on the rocky soil are those who, when they hear, receive the word with joy; and these have no firm root; they believe for a while, and in time of temptation fall away.",
                "reference" : "Luke 8:13"
            },
            {
                "text" : "The seventy returned with joy, saying, \"Lord, even the demons are subject to us in Your name.\"",
                "reference" : "Luke 10:17"
            },
            {
                "text" : "I tell you that in the same way, there will be more joy in heaven over one sinner who repents than over ninety-nine righteous persons who need no repentance.",
                "reference" : "Luke 15:7"
            },
            {
                "text" : "In the same way, I tell you, there is joy in the presence of the angels of God over one sinner who repents.",
                "reference" : "Luke 15:10"
            },
            {
                "text" : "While they still could not believe it because of their joy and amazement, He said to them, \"Have you anything here to eat?\"",
                "reference" : "Luke 24:41"
            },
            {
                "text" : "And they, after worshiping Him, returned to Jerusalem with great joy,",
                "reference" : "Luke 24:52"
            },
            {
                "text" : "He who has the bride is the bridegroom; but the friend of the bridegroom, who stands and hears him, rejoices greatly because of the bridegroom's voice. So this joy of mine has been made full.",
                "reference" : "John 3:29"
            },
            {
                "text" : "These things I have spoken to you so that My joy may be in you, and that your joy may be made full.",
                "reference" : "John 15:11"
            },
            {
                "text" : "Truly, truly, I say to you, that you will weep and lament, but the world will rejoice; you will grieve, but your grief will be turned into joy.",
                "reference" : "John 16:20"
            },
            {
                "text" : "Whenever a woman is in labor she has pain, because her hour has come; but when she gives birth to the child, she no longer remembers the anguish because of the joy that a child has been born into the world.",
                "reference" : "John 16:21"
            },
            {
                "text" : "Therefore you too have grief now; but I will see you again, and your heart will rejoice, and no one will take your joy away from you.",
                "reference" : "John 16:22"
            },
            {
                "text" : "Until now you have asked for nothing in My name; ask and you will receive, so that your joy may be made full.",
                "reference" : "John 16:24"
            },
            {
                "text" : "But now I come to You; and these things I speak in the world so that they may have My joy made full in themselves.",
                "reference" : "John 17:13"
            },
            {
                "text" : "So there was much rejoicing in that city.",
                "reference" : "Acts 8:8"
            },
            {
                "text" : "When she recognized Peter's voice, because of her joy she did not open the gate, but ran in and announced that Peter was standing in front of the gate.",
                "reference" : "Acts 12:14"
            },
            {
                "text" : "And the disciples were continually filled with joy and with the Holy Spirit.",
                "reference" : "Acts 13:52"
            },
            {
                "text" : "Therefore, being sent on their way by the church, they were passing through both Phoenicia and Samaria, describing in detail the conversion of the Gentiles, and were bringing great joy to all the brethren.",
                "reference" : "Acts 15:3"
            },
            {
                "text" : "For the kingdom of God is not eating and drinking, but righteousness and peace and joy in the Holy Spirit.",
                "reference" : "Romans 14:17"
            },
            {
                "text" : "Now may the God of hope fill you with all joy and peace in believing, so that you will abound in hope by the power of the Holy Spirit.",
                "reference" : "Romans 15:13"
            },
            {
                "text" : "Now I urge you, brethren, by our Lord Jesus Christ and by the love of the Spirit, to strive together with me in your prayers to God for me, that I may be rescued from those who are disobedient in Judea, and that my service for Jerusalem may prove acceptable to the saints; so that I may come to you in joy by the will of God and find refreshing rest in your company.",
                "reference" : "Romans 15:30-32"
            },
            {
                "text" : "Not that we lord it over your faith, but are workers with you for your joy; for in your faith you are standing firm.",
                "reference" : "2 Corinthians 1:24"
            },
            {
                "text" : "This is the very thing I wrote you, so that when I came, I would not have sorrow from those who ought to make me rejoice; having confidence in you all that my joy would be the joy of you all.",
                "reference" : "2 Corinthians 2:3"
            },
            {
                "text" : "Great is my confidence in you; great is my boasting on your behalf. I am filled with comfort; I am overflowing with joy in all our affliction.",
                "reference" : "2 Corinthians 7:4"
            },
            {
                "text" : "For this reason we have been comforted. And besides our comfort, we rejoiced even much more for the joy of Titus, because his spirit has been refreshed by you all.",
                "reference" : "2 Corinthians 7:13"
            },
            {
                "text" : "Now, brethren, we wish to make known to you the grace of God which has been given in the churches of Macedonia, that in a great ordeal of affliction their abundance of joy and their deep poverty overflowed in the wealth of their liberality.",
                "reference" : "2 Corinthians 8:1-2"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "I thank my God in all my remembrance of you, always offering prayer with joy in my every prayer for you all, in view of your participation in the gospel from the first day until now.",
                "reference" : "Philippians 1:3-5"
            },
            {
                "text" : "Convinced of this, I know that I will remain and continue with you all for your progress and joy in the faith,",
                "reference" : "Philippians 1:25"
            },
            {
                "text" : "Make my joy complete by being of the same mind, maintaining the same love, united in spirit, intent on one purpose.",
                "reference" : "Philippians 2:2"
            },
            {
                "text" : "Receive him then in the Lord with all joy, and hold men like him in high regard;",
                "reference" : "Philippians 2:29"
            },
            {
                "text" : "Therefore, my beloved brethren whom I long to see, my joy and crown, in this way stand firm in the Lord, my beloved.",
                "reference" : "Philippians 4:1"
            },
            {
                "text" : "Strengthened with all power, according to His glorious might, for the attaining of all steadfastness and patience; joyously giving thanks to the Father, who has qualified us to share in the inheritance of the saints in Light.",
                "reference" : "Colossians 1:11-12"
            },
            {
                "text" : "You also became imitators of us and of the Lord, having received the word in much tribulation with the joy of the Holy Spirit,",
                "reference" : "1 Thessalonians 1:6"
            },
            {
                "text" : "For who is our hope or joy or crown of exultation? Is it not even you, in the presence of our Lord Jesus at His coming?",
                "reference" : "1 Thessalonians 2:19"
            },
            {
                "text" : "For you are our glory and joy.",
                "reference" : "1 Thessalonians 2:20"
            },
            {
                "text" : "For what thanks can we render to God for you in return for all the joy with which we rejoice before our God on your account,",
                "reference" : "1 Thessalonians 3:9"
            },
            {
                "text" : "I thank God, whom I serve with a clear conscience the way my forefathers did, as I constantly remember you in my prayers night and day, longing to see you, even as I recall your tears, so that I may be filled with joy.",
                "reference" : "2 Thessalonians 1:3-4"
            },
            {
                "text" : "For I have come to have much joy and comfort in your love, because the hearts of the saints have been refreshed through you, brother.",
                "reference" : "Philemon 1:7"
            },
            {
                "text" : "For you showed sympathy to the prisoners and accepted joyfully the seizure of your property, knowing that you have for yourselves a better possession and a lasting one.",
                "reference" : "Hebrews 10:24"
            },
            {
                "text" : "Fixing our eyes on Jesus, the author and perfecter of faith, who for the joy set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God.",
                "reference" : "Hebrews 12:2"
            },
            {
                "text" : "All discipline for the moment seems not to be joyful, but sorrowful; yet to those who have been trained by it, afterwards it yields the peaceful fruit of righteousness.",
                "reference" : "Hebrews 12:11"
            },
            {
                "text" : "Obey your leaders and submit to them, for they keep watch over your souls as those who will give an account. Let them do this with joy and not with grief, for this would be unprofitable for you.",
                "reference" : "Hebrews 13:17"
            },
            {
                "text" : "Consider it all joy, my brethren, when you encounter various trials, knowing that the testing of your faith produces endurance.",
                "reference" : "James 1:2-3"
            },
            {
                "text" : "Be miserable and mourn and weep; let your laughter be turned into mourning and your joy to gloom.",
                "reference" : "James 4:9"
            },
            {
                "text" : "And though you have not seen Him, you love Him, and though you do not see Him now, but believe in Him, you greatly rejoice with joy inexpressible and full of glory,",
                "reference" : "1 Peter 1:8"
            },
            {
                "text" : "These things we write, so that our joy may be made complete.",
                "reference" : "1 John 1:4"
            },
            {
                "text" : "Though I have many things to write to you, I do not want to do so with paper and ink; but I hope to come to you and speak face to face, so that your joy may be made full.",
                "reference" : "2 John 1:12"
            },
            {
                "text" : "I have no greater joy than this, to hear of my children walking in the truth.",
                "reference" : "3 John 1:4"
            }
        ]
    },
    {
        "fruit" : "peace",
        "verses" :
        [
            {
                "text" : "And whatever city or village you enter, inquire who is worthy in it, and stay at his house until you leave that city. As you enter the house, give it your greeting. If the house is worthy, give it your blessing of peace. But if it is not worthy, take back your blessing of peace.",
                "reference" : "Matthew 10:11-13"
            },
            {
                "text" : "Do not think that I came to bring peace on the earth; I did not come to bring peace, but a sword.",
                "reference" : "Matthew 10:34"
            },
            {
                "text" : "And He said to her, \"Daughter, your faith has made you well; go in peace and be healed of your affliction.\"",
                "reference" : "Mark 5:34"
            },
            {
                "text" : "And you, child, will be called the prophet of the Most High; for you will go on BEFORE THE LORD TO PREPARE HIS WAYS; to give to His people the knowledge of salvation by the forgiveness of their sins, because of the tender mercy of our God, with which the Sunrise from on high will visit us, TO SHINE UPON THOSE WHO SIT IN DARKNESS AND THE SHADOW OF DEATH, to guide our feet into the way of peace.",
                "reference" : "Luke 1:76-79"
            },
            {
                "text" : "Glory to God in the highest, and on earth peace among men with whom He is pleased.",
                "reference" : "Luke 2:14"
            },
            {
                "text" : "Now Lord, You are releasing Your bond-servant to depart in peace, according to Your word; for my eyes have seen Your salvation, which You have prepared in the presence of all peoples,",
                "reference" : "Luke 2:29-31"
            },
            {
                "text" : "And He said to the woman, \"Your faith has saved you; go in peace.\"",
                "reference" : "Luke 7:50"
            },
            {
                "text" : "And He said to her, \"Daughter, your faith has made you well; go in peace.\"",
                "reference" : "Luke 8:48"
            },
            {
                "text" : "Whatever house you enter, first say, 'Peace be to this house.' If a man of peace is there, your peace will rest on him; but if not, it will return to you.",
                "reference" : "Luke 10:5-6"
            },
            {
                "text" : "When a strong man, fully armed, guards his own house, his possessions are undisturbed.",
                "reference" : "Luke 11:21"
            },
            {
                "text" : "Do you suppose that I came to grant peace on earth? I tell you, no, but rather division; for from now on five members in one household will be divided, three against two and two against three.",
                "reference" : "Luke 12:51-52"
            },
            {
                "text" : "Or else, while the other is still far away, he sends a delegation and asks for terms of peace. So then, none of you can be My disciple who does not give up all his own possessions.",
                "reference" : "Luke 14:32-33"
            },
            {
                "text" : "When He approached Jerusalem, He saw the city and wept over it, saying, \"If you had known in this day, even you, the things which make for peace! But now they have been hidden from your eyes.\"",
                "reference" : "Luke 19:41-42"
            },
            {
                "text" : "While they were telling these things, He Himself stood in their midst and said to them, \"Peace be to you.\"",
                "reference" : "Luke 24:36"
            },
            {
                "text" : "Peace I leave with you; My peace I give to you; not as the world gives do I give to you. Do not let your heart be troubled, nor let it be fearful.",
                "reference" : "John 14:27"
            },
            {
                "text" : "These things I have spoken to you, so that in Me you may have peace. In the world you have tribulation, but take courage; I have overcome the world.",
                "reference" : "John 16:33"
            },
            {
                "text" : "So when it was evening on that day, the first day of the week, and when the doors were shut where the disciples were, for fear of the Jews, Jesus came and stood in their midst and said to them, \"Peace be with you.\"",
                "reference" : "John 20:19"
            },
            {
                "text" : "So Jesus said to them again, \"Peace be with you; as the Father has sent Me, I also send you.\"",
                "reference" : "John 20:21"
            },
            {
                "text" : "After eight days His disciples were again inside, and Thomas with them. Jesus came, the doors having been shut, and stood in their midst and said, \"Peace be with you.\"",
                "reference" : "John 20:26"
            },
            {
                "text" : "On the following day he appeared to them as they were fighting together, and he tried to reconcile them in peace, saying, 'Men, you are brethren, why do you injure one another?'",
                "reference" : "Acts 7:26"
            },
            {
                "text" : "So the church throughout all Judea and Galilee and Samaria enjoyed peace, being built up; and going on in the fear of the Lord and in the comfort of the Holy Spirit, it continued to increase.",
                "reference" : "Acts 9:31"
            },
            {
                "text" : "The word which He sent to the sons of Israel, preaching peace through Jesus Christ (He is Lord of all)-you yourselves know the thing which took place throughout all Judea, starting from Galilee, after the baptism which John proclaimed.",
                "reference" : "Acts 10:36-37"
            },
            {
                "text" : "Now he was very angry with the people of Tyre and Sidon; and with one accord they came to him, and having won over Blastus the king's chamberlain, they were asking for peace, because their country was fed by the king's country.",
                "reference" : "Acts 12:20"
            },
            {
                "text" : "After they had spent time there, they were sent away from the brethren in peace to those who had sent them out.",
                "reference" : "Acts 15:33"
            },
            {
                "text" : "And the jailer reported these words to Paul, saying, \"The chief magistrates have sent to release you. Therefore come out now and go in peace.\"",
                "reference" : "Acts 16:36"
            },
            {
                "text" : "After Paul had been summoned, Tertullus began to accuse him, saying to the governor, \"Since we have through you attained much peace, and since by your providence reforms are being carried out for this nation, we acknowledge this in every way and everywhere, most excellent Felix, with all thankfulness.\"",
                "reference" : "Acts 24:2-3"
            },
            {
                "text" : "To all who are beloved of God in Rome, called as saints: Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "Romans 1:7"
            },
            {
                "text" : "There will be tribulation and distress for every soul of man who does evil, of the Jew first and also of the Greek, but glory and honor and peace to everyone who does good, to the Jew first and also to the Greek.",
                "reference" : "Romans 2:9-10"
            },
            {
                "text" : "THEIR FEET ARE SWIFT TO SHED BLOOD, DESTRUCTION AND MISERY ARE IN THEIR PATHS, AND THE PATH OF PEACE THEY HAVE NOT KNOWN.",
                "reference" : "Romans 3:15-17"
            },
            {
                "text" : "Therefore, having been justified by faith, we have peace with God through our Lord Jesus Christ, through whom also we have obtained our introduction by faith into this grace in which we stand; and we exult in hope of the glory of God.",
                "reference" : "Romans 5:1-2"
            },
            {
                "text" : "For the mind set on the flesh is death, but the mind set on the Spirit is life and peace,",
                "reference" : "Romans 8:6"
            },
            {
                "text" : "Therefore do not let what is for you a good thing be spoken of as evil; for the kingdom of God is not eating and drinking, but righteousness and peace and joy in the Holy Spirit.",
                "reference" : "Romans 14:16-17"
            },
            {
                "text" : "For he who in this way serves Christ is acceptable to God and approved by men. So then we pursue the things which make for peace and the building up of one another.",
                "reference" : "Romans 14:19"
            },
            {
                "text" : "Now may the God of hope fill you with all joy and peace in believing, so that you will abound in hope by the power of the Holy Spirit.",
                "reference" : "Romans 15:13"
            },
            {
                "text" : "Now the God of peace be with you all. Amen.",
                "reference" : "Romans 15:33"
            },
            {
                "text" : "The God of peace will soon crush Satan under your feet. The grace of our Lord Jesus be with you.",
                "reference" : "Romans 16:20"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "1 Corinthians 1:3"
            },
            {
                "text" : "Yet if the unbelieving one leaves, let him leave; the brother or the sister is not under bondage in such cases, but God has called us to peace.",
                "reference" : "1 Corinthians 7:15"
            },
            {
                "text" : "For you can all prophesy one by one, so that all may learn and all may be exhorted; and the spirits of prophets are subject to prophets; for God is not a God of confusion but of peace, as in all the churches of the saints.",
                "reference" : "1 Corinthians 14:31-33"
            },
            {
                "text" : "Now if Timothy comes, see that he is with you without cause to be afraid, for he is doing the Lord's work, as I also am. So let no one despise him. But send him on his way in peace, so that he may come to me; for I expect him with the brethren.",
                "reference" : "1 Corinthians 16:10-11"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "2 Corinthians 1:2"
            },
            {
                "text" : "Finally, brethren, rejoice, be made complete, be comforted, be like-minded, live in peace; and the God of love and peace will be with you.",
                "reference" : "2 Corinthians 13:11"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ, who gave Himself for our sins so that He might rescue us from this present evil age, according to the will of our God and Father, to whom be the glory forevermore. Amen.",
                "reference" : "Galatians 1:3-5"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "And those who will walk by this rule, peace and mercy be upon them, and upon the Israel of God.",
                "reference" : "Galatians 6:16"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "Ephesians 1:2"
            },
            {
                "text" : "For He Himself is our peace, who made both groups into one and broke down the barrier of the dividing wall, by abolishing in His flesh the enmity, which is the Law of commandments contained in ordinances, so that in Himself He might make the two into one new man, thus establishing peace, and might reconcile them both in one body to God through the cross, by it having put to death the enmity.",
                "reference" : "Ephesians 2:14-16"
            },
            {
                "text" : "AND HE CAME AND PREACHED PEACE TO YOU WHO WERE FAR AWAY, AND PEACE TO THOSE WHO WERE NEAR; for through Him we both have our access in one Spirit to the Father.",
                "reference" : "Ephesians 2:17-18"
            },
            {
                "text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love, being diligent to preserve the unity of the Spirit in the bond of peace.",
                "reference" : "Ephesians 4:1-3"
            },
            {
                "text" : "Stand firm therefore, HAVING GIRDED YOUR LOINS WITH TRUTH, and HAVING PUT ON THE BREASTPLATE OF RIGHTEOUSNESS, and having shod YOUR FEET WITH THE PREPARATION OF THE GOSPEL OF PEACE;",
                "reference" : "Ephesians 6:14-15"
            },
            {
                "text" : "Peace be to the brethren, and love with faith, from God the Father and the Lord Jesus Christ.",
                "reference" : "Ephesians 6:23"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "Philippians 1:2"
            },
            {
                "text" : "And the peace of God, which surpasses all comprehension, will guard your hearts and your minds in Christ Jesus.",
                "reference" : "Philippians 4:7"
            },
            {
                "text" : "The things you have learned and received and heard and seen in me, practice these things, and the God of peace will be with you.",
                "reference" : "Philippians 4:9"
            },
            {
                "text" : "To the saints and faithful brethren in Christ who are at Colossae: Grace to you and peace from God our Father.",
                "reference" : "Colossians 1:2"
            },
            {
                "text" : "Let the peace of Christ rule in your hearts, to which indeed you were called in one body; and be thankful.",
                "reference" : "Colossians 3:15"
            },
            {
                "text" : "Paul and Silvanus and Timothy, To the church of the Thessalonians in God the Father and the Lord Jesus Christ: Grace to you and peace.",
                "reference" : "1 Thessalonians 1:1"
            },
            {
                "text" : "While they are saying, \"Peace and safety!\" then destruction will come upon them suddenly like labor pains upon a woman with child, and they will not escape.",
                "reference" : "1 Thessalonians 5:3"
            },
            {
                "text" : "Now may the God of peace Himself sanctify you entirely; and may your spirit and soul and body be preserved complete, without blame at the coming of our Lord Jesus Christ.",
                "reference" : "1 Thessalonians 5:23"
            },
            {
                "text" : "Grace to you and peace from God the Father and the Lord Jesus Christ.",
                "reference" : "2 Thessalonians 1:2"
            },
            {
                "text" : "Now may the Lord of peace Himself continually grant you peace in every circumstance. The Lord be with you all!",
                "reference" : "2 Thessalonians 3:16"
            },
            {
                "text" : "To Timothy, my true child in the faith: Grace, mercy and peace from God the Father and Christ Jesus our Lord.",
                "reference" : "1 Timothy 1:2"
            },
            {
                "text" : "To Timothy, my beloved son: Grace, mercy and peace from God the Father and Christ Jesus our Lord.",
                "reference" : "2 Timothy 1:2"
            },
            {
                "text" : "Now flee from youthful lusts and pursue righteousness, faith, love and peace, with those who call on the Lord from a pure heart.",
                "reference" : "2 Timothy 2:22"
            },
            {
                "text" : "To Titus, my true child in a common faith: Grace and peace from God the Father and Christ Jesus our Savior.",
                "reference" : "Titus 1:4"
            },
            {
                "text" : "Grace to you and peace from God our Father and the Lord Jesus Christ.",
                "reference" : "Philemon 1:3"
            },
            {
                "text" : "For this Melchizedek, king of Salem, priest of the Most High God, who met Abraham as he was returning from the slaughter of the kings and blessed him, to whom also Abraham apportioned a tenth part of all the spoils, was first of all, by the translation of his name, king of righteousness, and then also king of Salem, which is king of peace.",
                "reference" : "Hebrews 7:1-2"
            },
            {
                "text" : "By faith Rahab the harlot did not perish along with those who were disobedient, after she had welcomed the spies in peace.",
                "reference" : "Hebrews 11:31"
            },
            {
                "text" : "Pursue peace with all men, and the sanctification without which no one will see the Lord.",
                "reference" : "Hebrews 12:14"
            },
            {
                "text" : "Now the God of peace, who brought up from the dead the great Shepherd of the sheep through the blood of the eternal covenant, even Jesus our Lord, equip you in every good thing to do His will, working in us that which is pleasing in His sight, through Jesus Christ, to whom be the glory forever and ever. Amen.",
                "reference" : "Hebrews 13:20-21"
            },
            {
                "text" : "If a brother or sister is without clothing and in need of daily food, and one of you says to them, \"Go in peace, be warmed and be filled,\" and yet you do not give them what is necessary for their body, what use is that?",
                "reference" : "James 2:15-16"
            },
            {
                "text" : "And the seed whose fruit is righteousness is sown in peace by those who make peace.",
                "reference" : "James 3:18"
            },
            {
                "text" : "Peter, an apostle of Jesus Christ, to those who reside as aliens, scattered throughout Pontus, Galatia, Cappadocia, Asia, and Bithynia, who are chosen according to the foreknowledge of God the Father, by the sanctifying work of the Spirit, to obey Jesus Christ and be sprinkled with His blood: May grace and peace be yours in the fullest measure.",
                "reference" : "1 Peter 1:1-2"
            },
            {
                "text" : "For, \"THE ONE WHO DESIRES LIFE, TO LOVE AND SEE GOOD DAYS, MUST KEEP HIS TONGUE FROM EVIL AND HIS LIPS FROM SPEAKING DECEIT. HE MUST TURN AWAY FROM EVIL AND DO GOOD; HE MUST SEEK PEACE AND PURSUE IT.\"",
                "reference" : "1 Peter 3:10-11"
            },
            {
                "text" : "Greet one another with a kiss of love. Peace be to you all who are in Christ.",
                "reference" : "1 Peter 5:14"
            },
            {
                "text" : "Grace and peace be multiplied to you in the knowledge of God and of Jesus our Lord;",
                "reference" : "2 Peter 1:2"
            },
            {
                "text" : "Therefore, beloved, since you look for these things, be diligent to be found by Him in peace, spotless and blameless,",
                "reference" : "2 Peter 3:14"
            },
            {
                "text" : "Grace, mercy and peace will be with us, from God the Father and from Jesus Christ, the Son of the Father, in truth and love.",
                "reference" : "2 John 1:3"
            },
            {
                "text" : "Peace be to you. The friends greet you. Greet the friends by name.",
                "reference" : "3 John 1:15"
            },
            {
                "text" : "May mercy and peace and love be multiplied to you.",
                "reference" : "Jude 1:2"
            },
            {
                "text" : "John to the seven churches that are in Asia: Grace to you and peace, from Him who is and who was and who is to come, and from the seven Spirits who are before His throne,",
                "reference" : "Revelation 1:4"
            },
            {
                "text" : "And another, a red horse, went out; and to him who sat on it, it was granted to take peace from the earth, and that men would slay one another; and a great sword was given to him.",
                "reference" : "Revelation 6:4"
            }
        ]
    },
    {
        "fruit" : "patience",
        "verses" :
        [
            {
                "text" : "Or do you think lightly of the riches of His kindness and tolerance and patience, not knowing that the kindness of God leads you to repentance?",
                "reference" : "Romans 2:4"
            },
            {
                "text" : "What if God, although willing to demonstrate His wrath and to make His power known, endured with much patience vessels of wrath prepared for destruction?",
                "reference" : "Romans 9:22"
            },
            {
                "text" : "But in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
                "reference" : "2 Corinthians 6:4-6"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love, being diligent to preserve the unity of the Spirit in the bond of peace.",
                "reference" : "Ephesians 4:1-3"
            },
            {
                "text" : "Strengthened with all power, according to His glorious might, for the attaining of all steadfastness and patience; joyously giving thanks to the Father, who has qualified us to share in the inheritance of the saints in Light.",
                "reference" : "Colossians 1:11-12"
            },
            {
                "text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience;",
                "reference" : "Colossians 3:12"
            },
            {
                "text" : "Yet for this reason I found mercy, so that in me as the foremost, Jesus Christ might demonstrate His perfect patience as an example for those who would believe in Him for eternal life.",
                "reference" : "1 Timothy 1:16"
            },
            {
                "text" : "Now you followed my teaching, conduct, purpose, faith, patience, love, perseverance, persecutions, and sufferings, such as happened to me at Antioch, at Iconium and at Lystra; what persecutions I endured, and out of them all the Lord rescued me!",
                "reference" : "2 Timothy 3:10-11"
            },
            {
                "text" : "I solemnly charge you in the presence of God and of Christ Jesus, who is to judge the living and the dead, and by His appearing and His kingdom: preach the word; be ready in season and out of season; reprove, rebuke, exhort, with great patience and instruction.",
                "reference" : "2 Timothy 4:1-2"
            },
            {
                "text" : "And we desire that each one of you show the same diligence so as to realize the full assurance of hope until the end, so that you will not be sluggish, but imitators of those who through faith and patience inherit the promises.",
                "reference" : "Hebrews 6:11-12"
            },
            {
                "text" : "As an example, brethren, of suffering and patience, take the prophets who spoke in the name of the Lord.",
                "reference" : "James 5:10"
            },
            {
                "text" : "Corresponding to that, baptism now saves you-not the removal of dirt from the flesh, but an appeal to God for a good conscience-through the resurrection of Jesus Christ, who is at the right hand of God, having gone into heaven, after angels and authorities and powers had been subjected to Him.",
                "reference" : "1 Peter 3:21-22"
            },
            {
                "text" : "Therefore, beloved, since you look for these things, be diligent to be found by Him in peace, spotless and blameless, and regard the patience of our Lord as salvation; just as also our beloved brother Paul, according to the wisdom given him, wrote to you,",
                "reference" : "2 Peter 3:14-15"
            }
        ]
    },
    {
        "fruit" : "kindness",
        "verses" :
        [
            {
                "text" : "Or do you think lightly of the riches of His kindness and tolerance and patience, not knowing that the kindness of God leads you to repentance?",
                "reference" : "Romans 2:4"
            },
            {
                "text" : "ALL HAVE TURNED ASIDE, TOGETHER THEY HAVE BECOME USELESS; THERE IS NONE WHO DOES GOOD, THERE IS NOT EVEN ONE.",
                "reference" : "Romans 3:12"
            },
            {
                "text" : "Behold then the kindness and severity of God; to those who fell, severity, but to you, God's kindness, if you continue in His kindness; otherwise you also will be cut off.",
                "reference" : "Romans 11:22"
            },
            {
                "text" : "But in everything commending ourselves as servants of God, in much endurance, in afflictions, in hardships, in distresses, in beatings, in imprisonments, in tumults, in labors, in sleeplessness, in hunger, in purity, in knowledge, in patience, in kindness, in the Holy Spirit, in genuine love,",
                "reference" : "2 Corinthians 6:4-6"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "But God, being rich in mercy, because of His great love with which He loved us, even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved), and raised us up with Him, and seated us with Him in the heavenly places in Christ Jesus, so that in the ages to come He might show the surpassing riches of His grace in kindness toward us in Christ Jesus.",
                "reference" : "Ephesians 2:4-7"
            },
            {
                "text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience;",
                "reference" : "Colossians 3:12"
            },
            {
                "text" : "But when the kindness of God our Savior and His love for mankind appeared, He saved us, not on the basis of deeds which we have done in righteousness, but according to His mercy, by the washing of regeneration and renewing by the Holy Spirit,",
                "reference" : "2 Timothy 3:4-5"
            }
        ]
    },
    {
        "fruit" : "goodness",
        "verses" :
        [
            {
                "text" : "And concerning you, my brethren, I myself also am convinced that you yourselves are full of goodness, filled with all knowledge and able also to admonish one another.",
                "reference" : "Romans 15:14"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "Therefore do not be partakers with them; for you were formerly darkness, but now you are Light in the Lord; walk as children of Light (for the fruit of the Light consists in all goodness and righteousness and truth), trying to learn what is pleasing to the Lord.",
                "reference" : "Ephesians 5:7-10"
            },
            {
                "text" : "To this end also we pray for you always, that our God will count you worthy of your calling, and fulfill every desire for goodness and the work of faith with power, so that the name of our Lord Jesus will be glorified in you, and you in Him, according to the grace of our God and the Lord Jesus Christ.",
                "reference" : "2 Thessalonians 1:11-12"
            }
        ]
    },
    {
        "fruit" : "faithfulness",
        "verses" :
        [
            {
                "text" : "Now when Jesus heard this, He marveled and said to those who were following, \"Truly I say to you, I have not found such great faith with anyone in Israel.\"",
                "reference" : "Matthew 8:10"
            },
            {
                "text" : "And they brought to Him a paralytic lying on a bed. Seeing their faith, Jesus said to the paralytic, \"Take courage, son; your sins are forgiven.\"",
                "reference" : "Matthew 9:2"
            },
            {
                "text" : "But Jesus turning and seeing her said, \"Daughter, take courage; your faith has made you well.\" At once the woman was made well.",
                "reference" : "Matthew 9:22"
            },
            {
                "text" : "When He entered the house, the blind men came up to Him, and Jesus said to them, \"Do you believe that I am able to do this?\" They said to Him, \"Yes, Lord.\" Then He touched their eyes, saying, \"It shall be done to you according to your faith.\"",
                "reference" : "Matthew 9:28-29"
            },
            {
                "text" : "Then Jesus said to her, \"O woman, your faith is great; it shall be done for you as you wish.\" And her daughter was healed at once.",
                "reference" : "Matthew 15:28"
            },
            {
                "text" : "And He said to them, \"Because of the littleness of your faith; for truly I say to you, if you have faith the size of a mustard seed, you will say to this mountain, 'Move from here to there,' and it will move; and nothing will be impossible to you.\"",
                "reference" : "Matthew 17:20"
            },
            {
                "text" : "And Jesus answered and said to them, \"Truly I say to you, if you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you say to this mountain, 'Be taken up and cast into the sea,' it will happen.\"",
                "reference" : "Matthew 21:21"
            },
            {
                "text" : "Woe to you, scribes and Pharisees, hypocrites! For you tithe mint and dill and cummin, and have neglected the weightier provisions of the law: justice and mercy and faithfulness; but these are the things you should have done without neglecting the others.",
                "reference" : "Matthew 23:23"
            },
            {
                "text" : "And Jesus seeing their faith *said to the paralytic, \"Son, your sins are forgiven.\"",
                "reference" : "Mark 2:5"
            },
            {
                "text" : "And He said to them, \"Why are you afraid? Do you still have no faith?\"",
                "reference" : "Mark 4:40"
            },
            {
                "text" : "And He said to her, \"Daughter, your faith has made you well; go in peace and be healed of your affliction.\"",
                "reference" : "Mark 5:34"
            },
            {
                "text" : "And Jesus said to him, \"Go; your faith has made you well.\" Immediately he regained his sight and began following Him on the road.",
                "reference" : "Mark 10:52"
            },
            {
                "text" : "Being reminded, Peter said to Him, \"Rabbi, look, the fig tree which You cursed has withered.\" And Jesus answered saying to them, \"Have faith in God.\"",
                "reference" : "Mark 11:21-22"
            },
            {
                "text" : "Seeing their faith, He said, \"Friend, your sins are forgiven you.\"",
                "reference" : "Luke 5:20"
            },
            {
                "text" : "Now when Jesus heard this, He marveled at him, and turned and said to the crowd that was following Him, \"I say to you, not even in Israel have I found such great faith.\"",
                "reference" : "Luke 7:9"
            },
            {
                "text" : "And He said to the woman, \"Your faith has saved you; go in peace.\"",
                "reference" : "Luke 7:50"
            },
            {
                "text" : "And He said to them, \"Where is your faith?\" They were fearful and amazed, saying to one another, \"Who then is this, that He commands even the winds and the water, and they obey Him?\"",
                "reference" : "Luke 8:25"
            },
            {
                "text" : "And He said to her, \"Daughter, your faith has made you well; go in peace.\"",
                "reference" : "Luke 8:48"
            },
            {
                "text" : "The apostles said to the Lord, \"Increase our faith!\"",
                "reference" : "Luke 17:5"
            },
            {
                "text" : "And the Lord said, \"If you had faith like a mustard seed, you would say to this mulberry tree, 'Be uprooted and be planted in the sea'; and it would obey you.\"",
                "reference" : "Luke 17:6"
            },
            {
                "text" : "And He said to him, \"Stand up and go; your faith has made you well.\"",
                "reference" : "Luke 17:19"
            },
            {
                "text" : "I tell you that He will bring about justice for them quickly. However, when the Son of Man comes, will He find faith on the earth?",
                "reference" : "Luke 18:8"
            },
            {
                "text" : "And Jesus said to him, \"Receive your sight; your faith has made you well.\"",
                "reference" : "Luke 18:42"
            },
            {
                "text" : "Simon, Simon, behold, Satan has demanded permission to sift you like wheat; but I have prayed for you, that your faith may not fail; and you, when once you have turned again, strengthen your brothers.",
                "reference" : "Luke 22:31-32"
            },
            {
                "text" : "And on the basis of faith in His name, it is the name of Jesus which has strengthened this man whom you see and know; and the faith which comes through Him has given him this perfect health in the presence of you all.",
                "reference" : "Acts 3:16"
            },
            {
                "text" : "The statement found approval with the whole congregation; and they chose Stephen, a man full of faith and of the Holy Spirit, and Philip, Prochorus, Nicanor, Timon, Parmenas and Nicolas, a proselyte from Antioch.",
                "reference" : "Acts 6:5"
            },
            {
                "text" : "The word of God kept on spreading; and the number of the disciples continued to increase greatly in Jerusalem, and a great many of the priests were becoming obedient to the faith.",
                "reference" : "Acts 6:7"
            },
            {
                "text" : "For he was a good man, and full of the Holy Spirit and of faith. And considerable numbers were brought to the Lord.",
                "reference" : "Acts 11:24"
            },
            {
                "text" : "But Elymas the magician (for so his name is translated) was opposing them, seeking to turn the proconsul away from the faith.",
                "reference" : "Acts 13:8"
            },
            {
                "text" : "This man was listening to Paul as he spoke, who, when he had fixed his gaze on him and had seen that he had faith to be made well, said with a loud voice, \"Stand upright on your feet.\" And he leaped up and began to walk.",
                "reference" : "Acts 14:9-10"
            },
            {
                "text" : "After they had preached the gospel to that city and had made many disciples, they returned to Lystra and to Iconium and to Antioch, strengthening the souls of the disciples, encouraging them to continue in the faith, and saying, \"Through many tribulations we must enter the kingdom of God.\"",
                "reference" : "Acts 14:21-22"
            },
            {
                "text" : "When they had arrived and gathered the church together, they began to report all things that God had done with them and how He had opened a door of faith to the Gentiles.",
                "reference" : "Acts 14:27"
            },
            {
                "text" : "And God, who knows the heart, testified to them giving them the Holy Spirit, just as He also did to us; and He made no distinction between us and them, cleansing their hearts by faith.",
                "reference" : "Acts 15:8-9"
            },
            {
                "text" : "So the churches were being strengthened in the faith, and were increasing in number daily.",
                "reference" : "Acts 16:5"
            },
            {
                "text" : "Therefore having overlooked the times of ignorance, God is now declaring to men that all people everywhere should repent, because He has fixed a day in which He will judge the world in righteousness through a Man whom He has appointed, having furnished proof to all men by raising Him from the dead.",
                "reference" : "Acts 17:30-31"
            },
            {
                "text" : "Solemnly testifying to both Jews and Greeks of repentance toward God and faith in our Lord Jesus Christ.",
                "reference" : "Acts 20:21"
            },
            {
                "text" : "But some days later Felix arrived with Drusilla, his wife who was a Jewess, and sent for Paul and heard him speak about faith in Christ Jesus.",
                "reference" : "Acts 24:24"
            },
            {
                "text" : "To open their eyes so that they may turn from darkness to light and from the dominion of Satan to God, that they may receive forgiveness of sins and an inheritance among those who have been sanctified by faith in Me.",
                "reference" : "Acts 26:18"
            },
            {
                "text" : "Through whom we have received grace and apostleship to bring about the obedience of faith among all the Gentiles for His name's sake, among whom you also are the called of Jesus Christ;",
                "reference" : "Romans 1:5-6"
            },
            {
                "text" : "First, I thank my God through Jesus Christ for you all, because your faith is being proclaimed throughout the whole world.",
                "reference" : "Romans 1:8"
            },
            {
                "text" : "For I long to see you so that I may impart some spiritual gift to you, that you may be established; that is, that I may be encouraged together with you while among you, each of us by the other's faith, both yours and mine.",
                "reference" : "Romans 1:11-12"
            },
            {
                "text" : "For in it the righteousness of God is revealed from faith to faith; as it is written, \"BUT THE RIGHTEOUS man SHALL LIVE BY FAITH.\"",
                "reference" : "Romans 1:17"
            },
            {
                "text" : "What then? If some did not believe, their unbelief will not nullify the faithfulness of God, will it?",
                "reference" : "Romans 3:3"
            },
            {
                "text" : "But now apart from the Law the righteousness of God has been manifested, being witnessed by the Law and the Prophets, even the righteousness of God through faith in Jesus Christ for all those who believe; for there is no distinction; for all have sinned and fall short of the glory of God,",
                "reference" : "Romans 3:21-23"
            },
            {
                "text" : "Whom God displayed publicly as a propitiation in His blood through faith. This was to demonstrate His righteousness, because in the forbearance of God He passed over the sins previously committed;",
                "reference" : "Romans 3:25"
            },
            {
                "text" : "For the demonstration, I say, of His righteousness at the present time, so that He would be just and the justifier of the one who has faith in Jesus.",
                "reference" : "Romans 3:26"
            },
            {
                "text" : "Where then is boasting? It is excluded. By what kind of law? Of works? No, but by a law of faith.",
                "reference" : "Romans 3:27"
            },
            {
                "text" : "For we maintain that a man is justified by faith apart from works of the Law.",
                "reference" : "Romans 3:28"
            },
            {
                "text" : "Or is God the God of Jews only? Is He not the God of Gentiles also? Yes, of Gentiles also, since indeed God who will justify the circumcised by faith and the uncircumcised through faith is one.",
                "reference" : "Romans 3:29-30"
            },
            {
                "text" : "Do we then nullify the Law through faith? May it never be! On the contrary, we establish the Law.",
                "reference" : "Romans 3:31"
            },
            {
                "text" : "Now to the one who works, his wage is not credited as a favor, but as what is due. But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness,",
                "reference" : "Romans 4:4-5"
            },
            {
                "text" : "Is this blessing then on the circumcised, or on the uncircumcised also? For we say, \"FAITH WAS CREDITED TO ABRAHAM AS RIGHTEOUSNESS.\"",
                "reference" : "Romans 4:9"
            },
            {
                "text" : "And he received the sign of circumcision, a seal of the righteousness of the faith which he had while uncircumcised, so that he might be the father of all who believe without being circumcised, that righteousness might be credited to them,",
                "reference" : "Romans 4:11"
            },
            {
                "text" : "And the father of circumcision to those who not only are of the circumcision, but who also follow in the steps of the faith of our father Abraham which he had while uncircumcised.",
                "reference" : "Romans 4:12"
            },
            {
                "text" : "For the promise to Abraham or to his descendants that he would be heir of the world was not through the Law, but through the righteousness of faith.",
                "reference" : "Romans 4:13"
            },
            {
                "text" : "For if those who are of the Law are heirs, faith is made void and the promise is nullified; for the Law brings about wrath, but where there is no law, there also is no violation.",
                "reference" : "Romans 4:14-15"
            },
            {
                "text" : "For this reason it is by faith, in order that it may be in accordance with grace, so that the promise will be guaranteed to all the descendants, not only to those who are of the Law, but also to those who are of the faith of Abraham, who is the father of us all,",
                "reference" : "Romans 4:16"
            },
            {
                "text" : "Without becoming weak in faith he contemplated his own body, now as good as dead since he was about a hundred years old, and the deadness of Sarah's womb; yet, with respect to the promise of God, he did not waver in unbelief but grew strong in faith, giving glory to God,",
                "reference" : "Romans 4:19-20"
            },
            {
                "text" : "Therefore, having been justified by faith, we have peace with God through our Lord Jesus Christ, through whom also we have obtained our introduction by faith into this grace in which we stand; and we exult in hope of the glory of God.",
                "reference" : "Romans 5:1-2"
            },
            {
                "text" : "What shall we say then? That Gentiles, who did not pursue righteousness, attained righteousness, even the righteousness which is by faith; but Israel, pursuing a law of righteousness, did not arrive at that law.",
                "reference" : "Romans 9:30-31"
            },
            {
                "text" : "Why? Because they did not pursue it by faith, but as though it were by works. They stumbled over the stumbling stone,",
                "reference" : "Romans 9:32"
            },
            {
                "text" : "But the righteousness based on faith speaks as follows: \"DO NOT SAY IN YOUR HEART, 'WHO WILL ASCEND INTO HEAVEN?' (that is, to bring Christ down),",
                "reference" : "Romans 10:6"
            },
            {
                "text" : "But what does it say? \"THE WORD IS NEAR YOU, IN YOUR MOUTH AND IN YOUR HEART\"-that is, the word of faith which we are preaching,",
                "reference" : "Romans 10:8"
            },
            {
                "text" : "So faith comes from hearing, and hearing by the word of Christ.",
                "reference" : "Romans 10:17"
            },
            {
                "text" : "Quite right, they were broken off for their unbelief, but you stand by your faith. Do not be conceited, but fear; for if God did not spare the natural branches, He will not spare you, either.",
                "reference" : "Romans 11:20-21"
            },
            {
                "text" : "For through the grace given to me I say to everyone among you not to think more highly of himself than he ought to think; but to think so as to have sound judgment, as God has allotted to each a measure of faith.",
                "reference" : "Romans 12:3"
            },
            {
                "text" : "Since we have gifts that differ according to the grace given to us, each of us is to exercise them accordingly: if prophecy, according to the proportion of his faith;",
                "reference" : "Romans 12:6"
            },
            {
                "text" : "Now accept the one who is weak in faith, but not for the purpose of passing judgment on his opinions.",
                "reference" : "Romans 14:1"
            },
            {
                "text" : "The faith which you have, have as your own conviction before God. Happy is he who does not condemn himself in what he approves.",
                "reference" : "Romans 14:22"
            },
            {
                "text" : "But he who doubts is condemned if he eats, because his eating is not from faith; and whatever is not from faith is sin.",
                "reference" : "Romans 14:23"
            },
            {
                "text" : "But now is manifested, and by the Scriptures of the prophets, according to the commandment of the eternal God, has been made known to all the nations, leading to obedience of faith; to the only wise God, through Jesus Christ, be the glory forever. Amen.",
                "reference" : "Romans 16:26-27"
            },
            {
                "text" : "I was with you in weakness and in fear and in much trembling, and my message and my preaching were not in persuasive words of wisdom, but in demonstration of the Spirit and of power, so that your faith would not rest on the wisdom of men, but on the power of God.",
                "reference" : "1 Corinthians 2:3-5"
            },
            {
                "text" : "For to one is given the word of wisdom through the Spirit, and to another the word of knowledge according to the same Spirit; to another faith by the same Spirit, and to another gifts of healing by the one Spirit,",
                "reference" : "1 Corinthians 12:8-9"
            },
            {
                "text" : "If I have the gift of prophecy, and know all mysteries and all knowledge; and if I have all faith, so as to remove mountains, but do not have love, I am nothing.",
                "reference" : "1 Corinthians 13:2"
            },
            {
                "text" : "But now faith, hope, love, abide these three; but the greatest of these is love.",
                "reference" : "1 Corinthians 13:13"
            },
            {
                "text" : "But if there is no resurrection of the dead, not even Christ has been raised; and if Christ has not been raised, then our preaching is vain, your faith also is vain.",
                "reference" : "1 Corinthians 15:13-14"
            },
            {
                "text" : "For if the dead are not raised, not even Christ has been raised; and if Christ has not been raised, your faith is worthless; you are still in your sins.",
                "reference" : "1 Corinthians 15:16-17"
            },
            {
                "text" : "Be on the alert, stand firm in the faith, act like men, be strong.",
                "reference" : "1 Corinthians 16:13"
            },
            {
                "text" : "Not that we lord it over your faith, but are workers with you for your joy; for in your faith you are standing firm.",
                "reference" : "2 Corinthians 1:24"
            },
            {
                "text" : "But having the same spirit of faith, according to what is written, \"I BELIEVED, THEREFORE I SPOKE,\" we also believe, therefore we also speak, knowing that He who raised the Lord Jesus will raise us also with Jesus and will present us with you.",
                "reference" : "2 Corinthians 4:13-14"
            },
            {
                "text" : "For we walk by faith, not by sight-",
                "reference" : "2 Corinthians 5:7"
            },
            {
                "text" : "But just as you abound in everything, in faith and utterance and knowledge and in all earnestness and in the love we inspired in you, see that you abound in this gracious work also.",
                "reference" : "2 Corinthians 8:7"
            },
            {
                "text" : "Not boasting beyond our measure, that is, in other men's labors, but with the hope that as your faith grows, we will be, within our sphere, enlarged even more by you,",
                "reference" : "2 Corinthians 10:15"
            },
            {
                "text" : "Test yourselves to see if you are in the faith; examine yourselves! Or do you not recognize this about yourselves, that Jesus Christ is in you-unless indeed you fail the test?",
                "reference" : "2 Corinthians 13:5"
            },
            {
                "text" : "I was still unknown by sight to the churches of Judea which were in Christ; but only, they kept hearing, \"He who once persecuted us is now preaching the faith which he once tried to destroy.\"",
                "reference" : "Galatians 1:22-23"
            },
            {
                "text" : "We are Jews by nature and not sinners from among the Gentiles; nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be justified by faith in Christ and not by the works of the Law; since by the works of the Law no flesh will be justified.",
                "reference" : "Galatians 2:15-16"
            },
            {
                "text" : "I have been crucified with Christ; and it is no longer I who live, but Christ lives in me; and the life which I now live in the flesh I live by faith in the Son of God, who loved me and gave Himself up for me.",
                "reference" : "Galatians 2:20"
            },
            {
                "text" : "This is the only thing I want to find out from you: did you receive the Spirit by the works of the Law, or by hearing with faith?",
                "reference" : "Galatians 3:2"
            },
            {
                "text" : "So then, does He who provides you with the Spirit and works miracles among you, do it by the works of the Law, or by hearing with faith?",
                "reference" : "Galatians 3:5"
            },
            {
                "text" : "Even so Abraham BELIEVED GOD, AND IT WAS RECKONED TO HIM AS RIGHTEOUSNESS. Therefore, be sure that it is those who are of faith who are sons of Abraham.",
                "reference" : "Galatians 3:6-7"
            },
            {
                "text" : "The Scripture, foreseeing that God would justify the Gentiles by faith, preached the gospel beforehand to Abraham, saying, \"ALL THE NATIONS WILL BE BLESSED IN YOU.\"",
                "reference" : "Galatians 3:8"
            },
            {
                "text" : "So then those who are of faith are blessed with Abraham, the believer.",
                "reference" : "Galatians 3:9"
            },
            {
                "text" : "Now that no one is justified by the Law before God is evident; for, \"THE RIGHTEOUS MAN SHALL LIVE BY FAITH.\"",
                "reference" : "Galatians 3:11"
            },
            {
                "text" : "However, the Law is not of faith; on the contrary, \"HE WHO PRACTICES THEM SHALL LIVE BY THEM.\"",
                "reference" : "Galatians 3:12"
            },
            {
                "text" : "Christ redeemed us from the curse of the Law, having become a curse for us-for it is written, \"CURSED IS EVERYONE WHO HANGS ON A TREE\"-in order that in Christ Jesus the blessing of Abraham might come to the Gentiles, so that we would receive the promise of the Spirit through faith.",
                "reference" : "Galatians 3:14"
            },
            {
                "text" : "But the Scripture has shut up everyone under sin, so that the promise by faith in Jesus Christ might be given to those who believe.",
                "reference" : "Galatians 3:22"
            },
            {
                "text" : "But before faith came, we were kept in custody under the law, being shut up to the faith which was later to be revealed.",
                "reference" : "Galatians 3:23"
            },
            {
                "text" : "Therefore the Law has become our tutor to lead us to Christ, so that we may be justified by faith. But now that faith has come, we are no longer under a tutor.",
                "reference" : "Galatians 3:24-25"
            },
            {
                "text" : "For you are all sons of God through faith in Christ Jesus.",
                "reference" : "Galatians 3:26"
            },
            {
                "text" : "For we through the Spirit, by faith, are waiting for the hope of righteousness.",
                "reference" : "Galatians 5:5"
            },
            {
                "text" : "For in Christ Jesus neither circumcision nor uncircumcision means anything, but faith working through love.",
                "reference" : "Galatians 5:6"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "So then, while we have opportunity, let us do good to all people, and especially to those who are of the household of the faith.",
                "reference" : "Galatians 6:10"
            },
            {
                "text" : "For this reason I too, having heard of the faith in the Lord Jesus which exists among you and your love for all the saints, do not cease giving thanks for you, while making mention of you in my prayers;",
                "reference" : "Ephesians 1:15-16"
            },
            {
                "text" : "For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; not as a result of works, so that no one may boast.",
                "reference" : "Ephesians 2:8-9"
            },
            {
                "text" : "This was in accordance with the eternal purpose which He carried out in Christ Jesus our Lord, in whom we have boldness and confident access through faith in Him.",
                "reference" : "Ephesians 3:11-12"
            },
            {
                "text" : "So that Christ may dwell in your hearts through faith; and that you, being rooted and grounded in love, may be able to comprehend with all the saints what is the breadth and length and height and depth, and to know the love of Christ which surpasses knowledge, that you may be filled up to all the fullness of God.",
                "reference" : "Ephesians 3:17-19"
            },
            {
                "text" : "There is one body and one Spirit, just as also you were called in one hope of your calling; one Lord, one faith, one baptism, one God and Father of all who is over all and through all and in all.",
                "reference" : "Ephesians 4:4-6"
            },
            {
                "text" : "And He gave some as apostles, and some as prophets, and some as evangelists, and some as pastors and teachers, for the equipping of the saints for the work of service, to the building up of the body of Christ; until we all attain to the unity of the faith, and of the knowledge of the Son of God, to a mature man, to the measure of the stature which belongs to the fullness of Christ.",
                "reference" : "Ephesians 4:11-13"
            },
            {
                "text" : "In addition to all, taking up the shield of faith with which you will be able to extinguish all the flaming arrows of the evil one.",
                "reference" : "Ephesians 6:16"
            },
            {
                "text" : "Peace be to the brethren, and love with faith, from God the Father and the Lord Jesus Christ.",
                "reference" : "Ephesians 6:23"
            },
            {
                "text" : "Convinced of this, I know that I will remain and continue with you all for your progress and joy in the faith, so that your proud confidence in me may abound in Christ Jesus through my coming to you again.",
                "reference" : "Philippians 1:25-26"
            },
            {
                "text" : "Only conduct yourselves in a manner worthy of the gospel of Christ, so that whether I come and see you or remain absent, I will hear of you that you are standing firm in one spirit, with one mind striving together for the faith of the gospel;",
                "reference" : "Philippians 1:27"
            },
            {
                "text" : "But even if I am being poured out as a drink offering upon the sacrifice and service of your faith, I rejoice and share my joy with you all.",
                "reference" : "Philippians 2:17"
            },
            {
                "text" : "And may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith,",
                "reference" : "Philippians 3:9"
            },
            {
                "text" : "We give thanks to God, the Father of our Lord Jesus Christ, praying always for you, since we heard of your faith in Christ Jesus and the love which you have for all the saints;",
                "reference" : "Colossians 1:3-4"
            },
            {
                "text" : "If indeed you continue in the faith firmly established and steadfast, and not moved away from the hope of the gospel that you have heard, which was proclaimed in all creation under heaven, and of which I, Paul, was made a minister.",
                "reference" : "Colossians 1:23"
            },
            {
                "text" : "For even though I am absent in body, nevertheless I am with you in spirit, rejoicing to see your good discipline and the stability of your faith in Christ.",
                "reference" : "Colossians 2:5"
            },
            {
                "text" : "Therefore as you have received Christ Jesus the Lord, so walk in Him, having been firmly rooted and now being built up in Him and established in your faith, just as you were instructed, and overflowing with gratitude.",
                "reference" : "Colossians 2:6-7"
            },
            {
                "text" : "And in Him you were also circumcised with a circumcision made without hands, in the removal of the body of the flesh by the circumcision of Christ; having been buried with Him in baptism, in which you were also raised up with Him through faith in the working of God, who raised Him from the dead.",
                "reference" : "Colossians 2:11-12"
            },
            {
                "text" : "We give thanks to God always for all of you, making mention of you in our prayers; constantly bearing in mind your work of faith and labor of love and steadfastness of hope in our Lord Jesus Christ in the presence of our God and Father, knowing, brethren beloved by God, His choice of you;",
                "reference" : "1 Thessalonians 1:2-4"
            },
            {
                "text" : "For the word of the Lord has sounded forth from you, not only in Macedonia and Achaia, but also in every place your faith toward God has gone forth, so that we have no need to say anything.",
                "reference" : "1 Thessalonians 1:8"
            },
            {
                "text" : "And we sent Timothy, our brother and God's fellow worker in the gospel of Christ, to strengthen and encourage you as to your faith,",
                "reference" : "1 Thessalonians 3:2"
            },
            {
                "text" : "For this reason, when I could endure it no longer, I also sent to find out about your faith, for fear that the tempter might have tempted you, and our labor would be in vain.",
                "reference" : "1 Thessalonians 3:5"
            },
            {
                "text" : "But now that Timothy has come to us from you, and has brought us good news of your faith and love, and that you always think kindly of us, longing to see us just as we also long to see you, for this reason, brethren, in all our distress and affliction we were comforted about you through your faith;",
                "reference" : "1 Thessalonians 3:6-7"
            },
            {
                "text" : "As we night and day keep praying most earnestly that we may see your face, and may complete what is lacking in your faith?",
                "reference" : "1 Thessalonians 3:10"
            },
            {
                "text" : "But since we are of the day, let us be sober, having put on the breastplate of faith and love, and as a helmet, the hope of salvation.",
                "reference" : "1 Thessalonians 5:8"
            },
            {
                "text" : "We ought always to give thanks to God for you, brethren, as is only fitting, because your faith is greatly enlarged, and the love of each one of you toward one another grows ever greater;",
                "reference" : "2 Thessalonians 1:3"
            },
            {
                "text" : "Therefore, we ourselves speak proudly of you among the churches of God for your perseverance and faith in the midst of all your persecutions and afflictions which you endure.",
                "reference" : "2 Thessalonians 1:4"
            },
            {
                "text" : "To this end also we pray for you always, that our God will count you worthy of your calling, and fulfill every desire for goodness and the work of faith with power,",
                "reference" : "2 Thessalonians 1:11"
            },
            {
                "text" : "But we should always give thanks to God for you, brethren beloved by the Lord, because God has chosen you from the beginning for salvation through sanctification by the Spirit and faith in the truth.",
                "reference" : "2 Thessalonians 2:13"
            },
            {
                "text" : "Finally, brethren, pray for us that the word of the Lord will spread rapidly and be glorified, just as it did also with you; and that we will be rescued from perverse and evil men; for not all have faith.",
                "reference" : "2 Thessalonians 3:1-2"
            },
            {
                "text" : "To Timothy, my true child in the faith: Grace, mercy and peace from God the Father and Christ Jesus our Lord.",
                "reference" : "1 Timothy 1:2"
            },
            {
                "text" : "As I urged you upon my departure for Macedonia, remain on at Ephesus so that you may instruct certain men not to teach strange doctrines, nor to pay attention to myths and endless genealogies, which give rise to mere speculation rather than furthering [the administration of God which is by faith.",
                "reference" : "1 Timothy 1:3-4"
            },
            {
                "text" : "But the goal of our instruction is love from a pure heart and a good conscience and a sincere faith.",
                "reference" : "1 Timothy 1:5"
            },
            {
                "text" : "I thank Christ Jesus our Lord, who has strengthened me, because He considered me faithful, putting me into service, even though I was formerly a blasphemer and a persecutor and a violent aggressor. Yet I was shown mercy because I acted ignorantly in unbelief; and the grace of our Lord was more than abundant, with the faith and love which are found in Christ Jesus.",
                "reference" : "1 Timothy 1:12-14"
            },
            {
                "text" : "This command I entrust to you, Timothy, my son, in accordance with the prophecies previously made concerning you, that by them you fight the good fight, keeping faith and a good conscience, which some have rejected and suffered shipwreck in regard to their faith.",
                "reference" : "1 Timothy 1:18-19"
            },
            {
                "text" : "For this I was appointed a preacher and an apostle (I am telling the truth, I am not lying) as a teacher of the Gentiles in faith and truth.",
                "reference" : "1 Timothy 2:7"
            },
            {
                "text" : "But women will be preserved through the bearing of children if they continue in faith and love and sanctity with self-restraint.",
                "reference" : "1 Timothy 2:15"
            },
            {
                "text" : "Deacons likewise must be men of dignity, not double-tongued, or addicted to much wine or fond of sordid gain, but holding to the mystery of the faith with a clear conscience.",
                "reference" : "1 Timothy 3:8-9"
            },
            {
                "text" : "For those who have served well as deacons obtain for themselves a high standing and great confidence in the faith that is in Christ Jesus.",
                "reference" : "1 Timothy 3:13"
            },
            {
                "text" : "But the Spirit explicitly says that in later times some will fall away from the faith, paying attention to deceitful spirits and doctrines of demons,",
                "reference" : "1 Timothy 4:1"
            },
            {
                "text" : "In pointing out these things to the brethren, you will be a good servant of Christ Jesus, constantly nourished on the words of the faith and of the sound doctrine which you have been following.",
                "reference" : "1 Timothy 4:6"
            },
            {
                "text" : "Let no one look down on your youthfulness, but rather in speech, conduct, love, faith and purity, show yourself an example of those who believe.",
                "reference" : "1 Timothy 4:12"
            },
            {
                "text" : "But if anyone does not provide for his own, and especially for those of his household, he has denied the faith and is worse than an unbeliever.",
                "reference" : "1 Timothy 5:8"
            },
            {
                "text" : "But refuse to put younger widows on the list, for when they feel sensual desires in disregard of Christ, they want to get married, thus incurring condemnation, because they have set aside their previous pledge.",
                "reference" : "1 Timothy 5:11-12"
            },
            {
                "text" : "For the love of money is a root of all sorts of evil, and some by longing for it have wandered away from the faith and pierced themselves with many griefs.",
                "reference" : "1 Timothy 6:10"
            },
            {
                "text" : "But flee from these things, you man of God, and pursue righteousness, godliness, faith, love, perseverance and gentleness.",
                "reference" : "1 Timothy 6:11"
            },
            {
                "text" : "Fight the good fight of faith; take hold of the eternal life to which you were called, and you made the good confession in the presence of many witnesses.",
                "reference" : "1 Timothy 6:12"
            },
            {
                "text" : "O Timothy, guard what has been entrusted to you, avoiding worldly and empty chatter and the opposing arguments of what is falsely called \"knowledge\"-which some have professed and thus gone astray from the faith. Grace be with you.",
                "reference" : "1 Timothy 6:20-21"
            },
            {
                "text" : "For I am mindful of the sincere faith within you, which first dwelt in your grandmother Lois and your mother Eunice, and I am sure that it is in you as well.",
                "reference" : "2 Timothy 1:5"
            },
            {
                "text" : "Retain the standard of sound words which you have heard from me, in the faith and love which are in Christ Jesus.",
                "reference" : "2 Timothy 1:13"
            },
            {
                "text" : "But avoid worldly and empty chatter, for it will lead to further ungodliness, and their talk will spread like gangrene. Among them are Hymenaeus and Philetus, men who have gone astray from the truth saying that the resurrection has already taken place, and they upset the faith of some.",
                "reference" : "2 Timothy 2:18"
            },
            {
                "text" : "Now flee from youthful lusts and pursue righteousness, faith, love and peace, with those who call on the Lord from a pure heart.",
                "reference" : "2 Timothy 2:22"
            },
            {
                "text" : "Just as Jannes and Jambres opposed Moses, so these men also oppose the truth, men of depraved mind, rejected in regard to the faith.",
                "reference" : "2 Timothy 3:8"
            },
            {
                "text" : "Now you followed my teaching, conduct, purpose, faith, patience, love, perseverance, persecutions, and sufferings, such as happened to me at Antioch, at Iconium and at Lystra; what persecutions I endured, and out of them all the Lord rescued me!",
                "reference" : "2 Timothy 3:10-11"
            },
            {
                "text" : "You, however, continue in the things you have learned and become convinced of, knowing from whom you have learned them, and that from childhood you have known the sacred writings which are able to give you the wisdom that leads to salvation through faith which is in Christ Jesus.",
                "reference" : "2 Timothy 3:14-15"
            },
            {
                "text" : "I have fought the good fight, I have finished the course, I have kept the faith;",
                "reference" : "2 Timothy 4:7"
            },
            {
                "text" : "Paul, a bond-servant of God and an apostle of Jesus Christ, for the faith of those chosen of God and the knowledge of the truth which is according to godliness,",
                "reference" : "Titus 1:1"
            },
            {
                "text" : "To Titus, my true child in a common faith: Grace and peace from God the Father and Christ Jesus our Savior.",
                "reference" : "Titus 1:4"
            },
            {
                "text" : "This testimony is true. For this reason reprove them severely so that they may be sound in the faith, not paying attention to Jewish myths and commandments of men who turn away from the truth.",
                "reference" : "Titus 1:13-14"
            },
            {
                "text" : "Older men are to be temperate, dignified, sensible, sound in faith, in love, in perseverance.",
                "reference" : "Titus 2:2"
            },
            {
                "text" : "Urge bondslaves to be subject to their own masters in everything, to be well-pleasing, not argumentative, not pilfering, but showing all good faith so that they will adorn the doctrine of God our Savior in every respect.",
                "reference" : "Titus 2:9-10"
            },
            {
                "text" : "All who are with me greet you. Greet those who love us in the faith. Grace be with you all.",
                "reference" : "Titus 3:15"
            },
            {
                "text" : "I thank my God always, making mention of you in my prayers, because I hear of your love and of the faith which you have toward the Lord Jesus and toward all the saints;",
                "reference" : "Philemon 1:4-5"
            },
            {
                "text" : "And I pray that the fellowship of your faith may become effective through the knowledge of every good thing which is in you for Christ's sake.",
                "reference" : "Philemon 1:6"
            },
            {
                "text" : "For indeed we have had good news preached to us, just as they also; but the word they heard did not profit them, because it was not united by faith in those who heard.",
                "reference" : "Hebrews 4:2"
            },
            {
                "text" : "Therefore leaving the elementary teaching about the Christ, let us press on to maturity, not laying again a foundation of repentance from dead works and of faith toward God, of instruction about washings and laying on of hands, and the resurrection of the dead and eternal judgment.",
                "reference" : "Hebrews 6:1-2"
            },
            {
                "text" : "And we desire that each one of you show the same diligence so as to realize the full assurance of hope until the end, so that you will not be sluggish, but imitators of those who through faith and patience inherit the promises.",
                "reference" : "Hebrews 6:11-12"
            },
            {
                "text" : "Let us draw near with a sincere heart in full assurance of faith, having our hearts sprinkled clean from an evil conscience and our bodies washed with pure water.",
                "reference" : "Hebrews 10:22"
            },
            {
                "text" : "BUT MY RIGHTEOUS ONE SHALL LIVE BY FAITH; AND IF HE SHRINKS BACK, MY SOUL HAS NO PLEASURE IN HIM.",
                "reference" : "Hebrews 10:38"
            },
            {
                "text" : "But we are not of those who shrink back to destruction, but of those who have faith to the preserving of the soul.",
                "reference" : "Hebrews 10:39"
            },
            {
                "text" : "Now faith is the assurance of things hoped for, the conviction of things not seen.",
                "reference" : "Hebrews 11:1"
            },
            {
                "text" : "By faith we understand that the worlds were prepared by the word of God, so that what is seen was not made out of things which are visible.",
                "reference" : "Hebrews 11:3"
            },
            {
                "text" : "By faith Abel offered to God a better sacrifice than Cain, through which he obtained the testimony that he was righteous, God testifying about his gifts, and through faith, though he is dead, he still speaks.",
                "reference" : "Hebrews 11:4"
            },
            {
                "text" : "By faith Enoch was taken up so that he would not see death; AND HE WAS NOT FOUND BECAUSE GOD TOOK HIM UP; for he obtained the witness that before his being taken up he was pleasing to God.",
                "reference" : "Hebrews 11:5"
            },
            {
                "text" : "And without faith it is impossible to please Him, for he who comes to God must believe that He is and that He is a rewarder of those who seek Him.",
                "reference" : "Hebrews 11:6"
            },
            {
                "text" : "By faith Noah, being warned by God about things not yet seen, in reverence prepared an ark for the salvation of his household, by which he condemned the world, and became an heir of the righteousness which is according to faith.",
                "reference" : "Hebrews 11:7"
            },
            {
                "text" : "By faith Abraham, when he was called, obeyed by going out to a place which he was to receive for an inheritance; and he went out, not knowing where he was going.",
                "reference" : "Hebrews 11:8"
            },
            {
                "text" : "By faith he lived as an alien in the land of promise, as in a foreign land, dwelling in tents with Isaac and Jacob, fellow heirs of the same promise;",
                "reference" : "Hebrews 11:9"
            },
            {
                "text" : "By faith even Sarah herself received ability to conceive, even beyond the proper time of life, since she considered Him faithful who had promised.",
                "reference" : "Hebrews 11:11"
            },
            {
                "text" : "All these died in faith, without receiving the promises, but having seen them and having welcomed them from a distance, and having confessed that they were strangers and exiles on the earth.",
                "reference" : "Hebrews 11:13"
            },
            {
                "text" : "By faith Abraham, when he was tested, offered up Isaac, and he who had received the promises was offering up his only begotten son;",
                "reference" : "Hebrews 11:17"
            },
            {
                "text" : "By faith Isaac blessed Jacob and Esau, even regarding things to come.",
                "reference" : "Hebrews 11:20"
            },
            {
                "text" : "By faith Jacob, as he was dying, blessed each of the sons of Joseph, and worshiped, leaning on the top of his staff.",
                "reference" : "Hebrews 11:21"
            },
            {
                "text" : "By faith Joseph, when he was dying, made mention of the exodus of the sons of Israel, and gave orders concerning his bones.",
                "reference" : "Hebrews 11:22"
            },
            {
                "text" : "By faith Moses, when he was born, was hidden for three months by his parents, because they saw he was a beautiful child; and they were not afraid of the king's edict.",
                "reference" : "Hebrews 11:23"
            },
            {
                "text" : "By faith Moses, when he had grown up, refused to be called the son of Pharaoh's daughter, choosing rather to endure ill-treatment with the people of God than to enjoy the passing pleasures of sin,",
                "reference" : "Hebrews 11:24-25"
            },
            {
                "text" : "By faith he left Egypt, not fearing the wrath of the king; for he endured, as seeing Him who is unseen.",
                "reference" : "Hebrews 11:27"
            },
            {
                "text" : "By faith he kept the Passover and the sprinkling of the blood, so that he who destroyed the firstborn would not touch them.",
                "reference" : "Hebrews 11:28"
            },
            {
                "text" : "By faith they passed through the Red Sea as though they were passing through dry land; and the Egyptians, when they attempted it, were drowned.",
                "reference" : "Hebrews 11:29"
            },
            {
                "text" : "By faith the walls of Jericho fell down after they had been encircled for seven days.",
                "reference" : "Hebrews 11:30"
            },
            {
                "text" : "By faith Rahab the harlot did not perish along with those who were disobedient, after she had welcomed the spies in peace.",
                "reference" : "Hebrews 11:31"
            },
            {
                "text" : "And what more shall I say? For time will fail me if I tell of Gideon, Barak, Samson, Jephthah, of David and Samuel and the prophets, who by faith conquered kingdoms, performed acts of righteousness, obtained promises, shut the mouths of lions,",
                "reference" : "Hebrews 11:32-33"
            },
            {
                "text" : "And all these, having gained approval through their faith, did not receive what was promised, because God had provided something better for us, so that apart from us they would not be made perfect.",
                "reference" : "Hebrews 11:39-40"
            },
            {
                "text" : "Fixing our eyes on Jesus, the author and perfecter of faith, who for the joy set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God.",
                "reference" : "Hebrews 12:2"
            },
            {
                "text" : "Remember those who led you, who spoke the word of God to you; and considering the result of their conduct, imitate their faith.",
                "reference" : "Hebrews 13:7"
            },
            {
                "text" : "Consider it all joy, my brethren, when you encounter various trials, knowing that the testing of your faith produces endurance.",
                "reference" : "James 1:2-3"
            },
            {
                "text" : "But if any of you lacks wisdom, let him ask of God, who gives to all generously and without reproach, and it will be given to him. But he must ask in faith without any doubting, for the one who doubts is like the surf of the sea, driven and tossed by the wind.",
                "reference" : "James 1:5-6"
            },
            {
                "text" : "My brethren, do not hold your faith in our glorious Lord Jesus Christ with an attitude of personal favoritism.",
                "reference" : "James 2:1"
            },
            {
                "text" : "Listen, my beloved brethren: did not God choose the poor of this world to be rich in faith and heirs of the kingdom which He promised to those who love Him?",
                "reference" : "James 2:5"
            },
            {
                "text" : "What use is it, my brethren, if someone says he has faith but he has no works? Can that faith save him?",
                "reference" : "James 2:14"
            },
            {
                "text" : "Even so faith, if it has no works, is dead, being by itself.",
                "reference" : "James 2:17"
            },
            {
                "text" : "But someone may well say, \"You have faith and I have works; show me your faith without the works, and I will show you my faith by my works.\"",
                "reference" : "James 2:18"
            },
            {
                "text" : "You believe that God is one. You do well; the demons also believe, and shudder. But are you willing to recognize, you foolish fellow, that faith without works is useless?",
                "reference" : "James 2:19-20"
            },
            {
                "text" : "You see that faith was working with his works, and as a result of the works, faith was perfected;",
                "reference" : "James 2:22"
            },
            {
                "text" : "You see that a man is justified by works and not by faith alone.",
                "reference" : "James 2:24"
            },
            {
                "text" : "For just as the body without the spirit is dead, so also faith without works is dead.",
                "reference" : "James 2:26"
            },
            {
                "text" : "Is anyone among you sick? Then he must call for the elders of the church and they are to pray over him, anointing him with oil in the name of the Lord; and the prayer offered in faith will restore the one who is sick, and the Lord will raise him up, and if he has committed sins, they will be forgiven him.",
                "reference" : "James 5:14-15"
            },
            {
                "text" : "Blessed be the God and Father of our Lord Jesus Christ, who according to His great mercy has caused us to be born again to a living hope through the resurrection of Jesus Christ from the dead, to obtain an inheritance which is imperishable and undefiled and will not fade away, reserved in heaven for you, who are protected by the power of God through faith for a salvation ready to be revealed in the last time.",
                "reference" : "1 Peter 1:3-5"
            },
            {
                "text" : "In this you greatly rejoice, even though now for a little while, if necessary, you have been distressed by various trials, so that the proof of your faith, being more precious than gold which is perishable, even though tested by fire, may be found to result in praise and glory and honor at the revelation of Jesus Christ;",
                "reference" : "1 Peter 1:6-7"
            },
            {
                "text" : "And though you have not seen Him, you love Him, and though you do not see Him now, but believe in Him, you greatly rejoice with joy inexpressible and full of glory, obtaining as the outcome of your faith the salvation of your souls.",
                "reference" : "1 Peter 1:8-9"
            },
            {
                "text" : "For He was foreknown before the foundation of the world, but has appeared in these last times for the sake of you who through Him are believers in God, who raised Him from the dead and gave Him glory, so that your faith and hope are in God.",
                "reference" : "1 Peter 1:20-21"
            },
            {
                "text" : "Be of sober spirit, be on the alert. Your adversary, the devil, prowls around like a roaring lion, seeking someone to devour. But resist him, firm in your faith, knowing that the same experiences of suffering are being accomplished by your brethren who are in the world.",
                "reference" : "1 Peter 5:8-9"
            },
            {
                "text" : "Simon Peter, a bond-servant and apostle of Jesus Christ, To those who have received a faith of the same kind as ours, by the righteousness of our God and Savior, Jesus Christ:",
                "reference" : "2 Peter 1:1"
            },
            {
                "text" : "Now for this very reason also, applying all diligence, in your faith supply moral excellence, and in your moral excellence, knowledge,",
                "reference" : "2 Peter 1:5"
            },
            {
                "text" : "For whatever is born of God overcomes the world; and this is the victory that has overcome the world-our faith.",
                "reference" : "1 John 5:4"
            },
            {
                "text" : "Beloved, while I was making every effort to write you about our common salvation, I felt the necessity to write to you appealing that you contend earnestly for the faith which was once for all handed down to the saints.",
                "reference" : "Jude 1:3"
            },
            {
                "text" : "But you, beloved, building yourselves up on your most holy faith, praying in the Holy Spirit, keep yourselves in the love of God, waiting anxiously for the mercy of our Lord Jesus Christ to eternal life.",
                "reference" : "Jude 1:20-21"
            },
            {
                "text" : "I know where you dwell, where Satan's throne is; and you hold fast My name, and did not deny My faith even in the days of Antipas, My witness, My faithful one, who was killed among you, where Satan dwells.",
                "reference" : "Revelation 2:13"
            },
            {
                "text" : "I know your deeds, and your love and faith and service and perseverance, and that your deeds of late are greater than at first.",
                "reference" : "Revelation 2:19"
            },
            {
                "text" : "If anyone is destined for captivity, to captivity he goes; if anyone kills with the sword, with the sword he must be killed. Here is the perseverance and the faith of the saints.",
                "reference" : "Revelation 13:10"
            },
            {
                "text" : "Here is the perseverance of the saints who keep the commandments of God and their faith in Jesus.",
                "reference" : "Revelation 14:12"
            }
        ]
    },
    {
        "fruit" : "gentleness",
        "verses" :
        [
            {
                "text" : "What do you desire? Shall I come to you with a rod, or with love and a spirit of gentleness?",
                "reference" : "1 Corinthians 4:21"
            },
            {
                "text" : "Now I, Paul, myself urge you by the meekness and gentleness of Christ-I who am meek when face to face with you, but bold toward you when absent!",
                "reference" : "2 Corinthians 10:1"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "Brethren, even if anyone is caught in any trespass, you who are spiritual, restore such a one in a spirit of gentleness; each one looking to yourself, so that you too will not be tempted.",
                "reference" : "Galatians 6:1"
            },
            {
                "text" : "Therefore I, the prisoner of the Lord, implore you to walk in a manner worthy of the calling with which you have been called, with all humility and gentleness, with patience, showing tolerance for one another in love, being diligent to preserve the unity of the Spirit in the bond of peace.",
                "reference" : "Ephesians 4:1-3"
            },
            {
                "text" : "So, as those who have been chosen of God, holy and beloved, put on a heart of compassion, kindness, humility, gentleness and patience; bearing with one another, and forgiving each other, whoever has a complaint against anyone; just as the Lord forgave you, so also should you.",
                "reference" : "Colossians 3:12-13"
            },
            {
                "text" : "The Lord's bond-servant must not be quarrelsome, but be kind to all, able to teach, patient when wronged, with gentleness correcting those who are in opposition, if perhaps God may grant them repentance leading to the knowledge of the truth,",
                "reference" : "2 Timothy 2:24-25"
            },
            {
                "text" : "Remind them to be subject to rulers, to authorities, to be obedient, to be ready for every good deed, to malign no one, to be peaceable, gentle, showing every consideration for all men.",
                "reference" : "Titus 3:1-2"
            },
            {
                "text" : "Therefore, putting aside all filthiness and all that remains of wickedness, in humility receive the word implanted, which is able to save your souls.",
                "reference" : "James 1:21"
            },
            {
                "text" : "Who among you is wise and understanding? Let him show by his good behavior his deeds in the gentleness of wisdom.",
                "reference" : "James 3:13"
            },
            {
                "text" : "But even if you should suffer for the sake of righteousness, you are blessed. AND DO NOT FEAR THEIR INTIMIDATION, AND DO NOT BE TROUBLED, but sanctify Christ as Lord in your hearts, always being ready to make a defense to everyone who asks you to give an account for the hope that is in you, yet with gentleness and reverence;",
                "reference" : "1 Peter 3:14-15"
            }
        ]
    },
    {
        "fruit" : "selfcontrol",
        "verses" :
        [
            {
                "text" : "But as he was discussing righteousness, self-control and the judgment to come, Felix became frightened and said, \"Go away for the present, and when I find time I will summon you.\"",
                "reference" : "Act 24:25"
            },
            {
                "text" : "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "reference" : "Galatians 5:22-23"
            },
            {
                "text" : "Now for this very reason also, applying all diligence, in your faith supply moral excellence, and in your moral excellence, knowledge, and in your knowledge, self-control, and in your self-control, perseverance, and in your perseverance, godliness, and in your godliness, brotherly kindness, and in your brotherly kindness, love.",
                "reference" : "2 Peter 1:5-7"
            }
        ]
    }
]
